{
    "5127": {
        "chapter": 59,
        "verse-number": 1,
        "verse-arabic": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
        "verse-english": "Whatever is in the heavens and whatever is on the earth exalts Allah, and He is the Exalted in Might, the Wise.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Whatever is in the heavens and whatever is on the earth exalts God,"
            },
            {
                "clause": "and He is the Exalted in Might,"
            },
            {
                "clause": "the Wise."
            }
        ]
    },
    "5128": {
        "chapter": 59,
        "verse-number": 2,
        "verse-arabic": "هُوَ الَّذِي أَخْرَجَ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ مِن دِيَارِهِمْ لِأَوَّلِ الْحَشْرِ ۚ مَا ظَنَنتُمْ أَن يَخْرُجُوا ۖ وَظَنُّوا أَنَّهُم مَّانِعَتُهُمْ حُصُونُهُم مِّنَ اللَّهِ فَأَتَاهُمُ اللَّهُ مِنْ حَيْثُ لَمْ يَحْتَسِبُوا ۖ وَقَذَفَ فِي قُلُوبِهِمُ الرُّعْبَ ۚ يُخْرِبُونَ بُيُوتَهُم بِأَيْدِيهِمْ وَأَيْدِي الْمُؤْمِنِينَ فَاعْتَبِرُوا يَا أُولِي الْأَبْصَارِ",
        "verse-english": "It is He who expelled the ones who disbelieved among the People of the Scripture from their homes at the first gathering. You did not think they would leave, and they thought that their fortresses would protect them from Allah; but [the decree of] Allah came upon them from where they had not expected, and He cast terror into their hearts [so] they destroyed their houses by their [own] hands and the hands of the believers. So take warning, O people of vision.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "It is He who expelled the ones who disbelieved among the People of the Scripture from their homes at the first gathering."
            },
            {
                "clause": "You did not think they would leave,"
            },
            {
                "clause": "and they thought that their fortresses would protect them from God;"
            },
            {
                "clause": "but [the decree of] God came upon them from where they had not expected,"
            },
            {
                "clause": "and He cast terror into their hearts [so] they destroyed their houses by their [own] hands and the hands of the believers."
            },
            {
                "clause": "So take warning,"
            },
            {
                "clause": "O people of vision."
            }
        ]
    },
    "5129": {
        "chapter": 59,
        "verse-number": 3,
        "verse-arabic": "وَلَوْلَا أَن كَتَبَ اللَّهُ عَلَيْهِمُ الْجَلَاءَ لَعَذَّبَهُمْ فِي الدُّنْيَا ۖ وَلَهُمْ فِي الْآخِرَةِ عَذَابُ النَّارِ",
        "verse-english": "And if not that Allah had decreed for them evacuation, He would have punished them in [this] world, and for them in the Hereafter is the punishment of the Fire.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And if not that God had decreed for them evacuation,"
            },
            {
                "clause": "He would have punished them in [this] world,"
            },
            {
                "clause": "and for them in the Hereafter is the punishment of the Fire."
            }
        ]
    },
    "5130": {
        "chapter": 59,
        "verse-number": 4,
        "verse-arabic": "ذَٰلِكَ بِأَنَّهُمْ شَاقُّوا اللَّهَ وَرَسُولَهُ ۖ وَمَن يُشَاقِّ اللَّهَ فَإِنَّ اللَّهَ شَدِيدُ الْعِقَابِ",
        "verse-english": "That is because they opposed Allah and His Messenger. And whoever opposes Allah - then indeed, Allah is severe in penalty.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "That is because they opposed God and His Messenger."
            },
            {
                "clause": "And whoever opposes God -"
            },
            {
                "clause": "then indeed,"
            },
            {
                "clause": "God is severe in penalty."
            }
        ]
    },
    "5131": {
        "chapter": 59,
        "verse-number": 5,
        "verse-arabic": "مَا قَطَعْتُم مِّن لِّينَةٍ أَوْ تَرَكْتُمُوهَا قَائِمَةً عَلَىٰ أُصُولِهَا فَبِإِذْنِ اللَّهِ وَلِيُخْزِيَ الْفَاسِقِينَ",
        "verse-english": "Whatever you have cut down of [their] palm trees or left standing on their trunks - it was by permission of Allah and so He would disgrace the defiantly disobedient.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Whatever you have cut down of [their] palm trees or left standing on their trunks -"
            },
            {
                "clause": "it was by permission of God and so He would disgrace the defiantly disobedient."
            }
        ]
    },
    "5132": {
        "chapter": 59,
        "verse-number": 6,
        "verse-arabic": "وَمَا أَفَاءَ اللَّهُ عَلَىٰ رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلَا رِكَابٍ وَلَٰكِنَّ اللَّهَ يُسَلِّطُ رُسُلَهُ عَلَىٰ مَن يَشَاءُ ۚ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
        "verse-english": "And what Allah restored [of property] to His Messenger from them - you did not spur for it [in an expedition] any horses or camels, but Allah gives His messengers power over whom He wills, and Allah is over all things competent.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And what God restored [of property] to His Messenger from them -"
            },
            {
                "clause": "you did not spur for it [in an expedition] any horses or camels,"
            },
            {
                "clause": "but God gives His messengers power over whom He wills,"
            },
            {
                "clause": "and God is over all things competent."
            }
        ]
    },
    "5133": {
        "chapter": 59,
        "verse-number": 7,
        "verse-arabic": "مَّا أَفَاءَ اللَّهُ عَلَىٰ رَسُولِهِ مِنْ أَهْلِ الْقُرَىٰ فَلِلَّهِ وَلِلرَّسُولِ وَلِذِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ كَيْ لَا يَكُونَ دُولَةً بَيْنَ الْأَغْنِيَاءِ مِنكُمْ ۚ وَمَا آتَاكُمُ الرَّسُولُ فَخُذُوهُ وَمَا نَهَاكُمْ عَنْهُ فَانتَهُوا ۚ وَاتَّقُوا اللَّهَ ۖ إِنَّ اللَّهَ شَدِيدُ الْعِقَابِ",
        "verse-english": "And what Allah restored to His Messenger from the people of the towns - it is for Allah and for the Messenger and for [his] near relatives and orphans and the [stranded] traveler - so that it will not be a perpetual distribution among the rich from among you. And whatever the Messenger has given you - take; and what he has forbidden you - refrain from. And fear Allah; indeed, Allah is severe in penalty.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And what God restored to His Messenger from the people of the towns -"
            },
            {
                "clause": "it is for God and for the Messenger and for [his] near relatives and orphans and the [stranded] traveler -"
            },
            {
                "clause": "so that it will not be a perpetual distribution among the rich from among you."
            },
            {
                "clause": "And whatever the Messenger has given you -"
            },
            {
                "clause": "take;"
            },
            {
                "clause": "and what he has forbidden you -"
            },
            {
                "clause": "refrain from."
            },
            {
                "clause": "And fear God;"
            },
            {
                "clause": "indeed,"
            },
            {
                "clause": "God is severe in penalty."
            }
        ]
    },
    "5134": {
        "chapter": 59,
        "verse-number": 8,
        "verse-arabic": "لِلْفُقَرَاءِ الْمُهَاجِرِينَ الَّذِينَ أُخْرِجُوا مِن دِيَارِهِمْ وَأَمْوَالِهِمْ يَبْتَغُونَ فَضْلًا مِّنَ اللَّهِ وَرِضْوَانًا وَيَنصُرُونَ اللَّهَ وَرَسُولَهُ ۚ أُولَٰئِكَ هُمُ الصَّادِقُونَ",
        "verse-english": "For the poor emigrants who were expelled from their homes and their properties, seeking bounty from Allah and [His] approval and supporting Allah and His Messenger, [there is also a share]. Those are the truthful.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "For the poor emigrants who were expelled from their homes and their properties,"
            },
            {
                "clause": "seeking bounty from God and [His] approval and supporting God and His Messenger,"
            },
            {
                "clause": "[there is also a share]."
            },
            {
                "clause": "Those are the truthful."
            }
        ]
    },
    "5135": {
        "chapter": 59,
        "verse-number": 9,
        "verse-arabic": "وَالَّذِينَ تَبَوَّءُوا الدَّارَ وَالْإِيمَانَ مِن قَبْلِهِمْ يُحِبُّونَ مَنْ هَاجَرَ إِلَيْهِمْ وَلَا يَجِدُونَ فِي صُدُورِهِمْ حَاجَةً مِّمَّا أُوتُوا وَيُؤْثِرُونَ عَلَىٰ أَنفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ ۚ وَمَن يُوقَ شُحَّ نَفْسِهِ فَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ",
        "verse-english": "And [also for] those who were settled in al-Madinah and [adopted] the faith before them. They love those who emigrated to them and find not any want in their breasts of what the emigrants were given but give [them] preference over themselves, even though they are in privation. And whoever is protected from the stinginess of his soul - it is those who will be the successful.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And [also for] those who were settled in al-"
            },
            {
                "clause": "Madinah and [adopted] the faith before them."
            },
            {
                "clause": "They love those who emigrated to them and find not any want in their breasts of what the emigrants were given but give [them] preference over themselves,"
            },
            {
                "clause": "even though they are in privation."
            },
            {
                "clause": "And whoever is protected from the stinginess of his soul -"
            },
            {
                "clause": "it is those who will be the successful."
            }
        ]
    },
    "5136": {
        "chapter": 59,
        "verse-number": 10,
        "verse-arabic": "وَالَّذِينَ جَاءُوا مِن بَعْدِهِمْ يَقُولُونَ رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِّلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَّحِيمٌ",
        "verse-english": "And [there is a share for] those who came after them, saying, \"Our Lord, forgive us and our brothers who preceded us in faith and put not in our hearts [any] resentment toward those who have believed. Our Lord, indeed You are Kind and Merciful.\"",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And [there is a share for] those who came after them,"
            },
            {
                "clause": "saying,"
            },
            {
                "clause": "\"Our Lord,"
            },
            {
                "clause": "forgive us and our brothers who preceded us in faith and put not in our hearts [any] resentment toward those who have believed."
            },
            {
                "clause": "Our Lord,"
            },
            {
                "clause": "indeed You are Kind and Merciful."
            },
            {
                "clause": "\""
            }
        ]
    },
    "5137": {
        "chapter": 59,
        "verse-number": 11,
        "verse-arabic": "۞ أَلَمْ تَرَ إِلَى الَّذِينَ نَافَقُوا يَقُولُونَ لِإِخْوَانِهِمُ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ لَئِنْ أُخْرِجْتُمْ لَنَخْرُجَنَّ مَعَكُمْ وَلَا نُطِيعُ فِيكُمْ أَحَدًا أَبَدًا وَإِن قُوتِلْتُمْ لَنَنصُرَنَّكُمْ وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ",
        "verse-english": "Have you not considered those who practice hypocrisy, saying to their brothers who have disbelieved among the People of the Scripture, \"If you are expelled, we will surely leave with you, and we will not obey, in regard to you, anyone - ever; and if you are fought, we will surely aid you.\" But Allah testifies that they are liars.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Have you not considered those who practice hypocrisy,"
            },
            {
                "clause": "saying to their brothers who have disbelieved among the People of the Scripture,"
            },
            {
                "clause": "\"If you are expelled,"
            },
            {
                "clause": "we will surely leave with you,"
            },
            {
                "clause": "and we will not obey,"
            },
            {
                "clause": "in regard to you,"
            },
            {
                "clause": "anyone -"
            },
            {
                "clause": "ever;"
            },
            {
                "clause": "and if you are fought,"
            },
            {
                "clause": "we will surely aid you."
            },
            {
                "clause": "\" But God testifies that they are liars."
            }
        ]
    },
    "5138": {
        "chapter": 59,
        "verse-number": 12,
        "verse-arabic": "لَئِنْ أُخْرِجُوا لَا يَخْرُجُونَ مَعَهُمْ وَلَئِن قُوتِلُوا لَا يَنصُرُونَهُمْ وَلَئِن نَّصَرُوهُمْ لَيُوَلُّنَّ الْأَدْبَارَ ثُمَّ لَا يُنصَرُونَ",
        "verse-english": "If they are expelled, they will not leave with them, and if they are fought, they will not aid them. And [even] if they should aid them, they will surely turn their backs; then [thereafter] they will not be aided.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "If they are expelled,"
            },
            {
                "clause": "they will not leave with them,"
            },
            {
                "clause": "and if they are fought,"
            },
            {
                "clause": "they will not aid them."
            },
            {
                "clause": "And [even] if they should aid them,"
            },
            {
                "clause": "they will surely turn their backs;"
            },
            {
                "clause": "then [thereafter] they will not be aided."
            }
        ]
    },
    "5139": {
        "chapter": 59,
        "verse-number": 13,
        "verse-arabic": "لَأَنتُمْ أَشَدُّ رَهْبَةً فِي صُدُورِهِم مِّنَ اللَّهِ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَفْقَهُونَ",
        "verse-english": "You [believers] are more fearful within their breasts than Allah. That is because they are a people who do not understand.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "You [believers] are more fearful within their breasts than God."
            },
            {
                "clause": "That is because they are a people who do not understand."
            }
        ]
    },
    "5140": {
        "chapter": 59,
        "verse-number": 14,
        "verse-arabic": "لَا يُقَاتِلُونَكُمْ جَمِيعًا إِلَّا فِي قُرًى مُّحَصَّنَةٍ أَوْ مِن وَرَاءِ جُدُرٍ ۚ بَأْسُهُم بَيْنَهُمْ شَدِيدٌ ۚ تَحْسَبُهُمْ جَمِيعًا وَقُلُوبُهُمْ شَتَّىٰ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَعْقِلُونَ",
        "verse-english": "They will not fight you all except within fortified cities or from behind walls. Their violence among themselves is severe. You think they are together, but their hearts are diverse. That is because they are a people who do not reason.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "They will not fight you all except within fortified cities or from behind walls."
            },
            {
                "clause": "Their violence among themselves is severe."
            },
            {
                "clause": "You think they are together,"
            },
            {
                "clause": "but their hearts are diverse."
            },
            {
                "clause": "That is because they are a people who do not reason."
            }
        ]
    },
    "5141": {
        "chapter": 59,
        "verse-number": 15,
        "verse-arabic": "كَمَثَلِ الَّذِينَ مِن قَبْلِهِمْ قَرِيبًا ۖ ذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ",
        "verse-english": "[Theirs is] like the example of those shortly before them: they tasted the bad consequence of their affair, and they will have a painful punishment.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "[Theirs is] like the example of those shortly before them:"
            },
            {
                "clause": "they tasted the bad consequence of their affair,"
            },
            {
                "clause": "and they will have a painful punishment."
            }
        ]
    },
    "5142": {
        "chapter": 59,
        "verse-number": 16,
        "verse-arabic": "كَمَثَلِ الشَّيْطَانِ إِذْ قَالَ لِلْإِنسَانِ اكْفُرْ فَلَمَّا كَفَرَ قَالَ إِنِّي بَرِيءٌ مِّنكَ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ",
        "verse-english": "[The hypocrites are] like the example of Satan when he says to man, \"Disbelieve.\" But when he disbelieves, he says, \"Indeed, I am disassociated from you. Indeed, I fear Allah, Lord of the worlds.\"",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "[The hypocrites are] like the example of Satan when he says to man,"
            },
            {
                "clause": "\"Disbelieve."
            },
            {
                "clause": "\" But when he disbelieves,"
            },
            {
                "clause": "he says,"
            },
            {
                "clause": "\"Indeed,"
            },
            {
                "clause": "I am disassociated from you."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "I fear God,"
            },
            {
                "clause": "Lord of the worlds."
            },
            {
                "clause": "\""
            }
        ]
    },
    "5143": {
        "chapter": 59,
        "verse-number": 17,
        "verse-arabic": "فَكَانَ عَاقِبَتَهُمَا أَنَّهُمَا فِي النَّارِ خَالِدَيْنِ فِيهَا ۚ وَذَٰلِكَ جَزَاءُ الظَّالِمِينَ",
        "verse-english": "So the outcome for both of them is that they will be in the Fire, abiding eternally therein. And that is the recompense of the wrong-doers.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "So the outcome for both of them is that they will be in the Fire,"
            },
            {
                "clause": "abiding eternally therein."
            },
            {
                "clause": "And that is the recompense of the wrong-"
            },
            {
                "clause": "doers."
            }
        ]
    },
    "5144": {
        "chapter": 59,
        "verse-number": 18,
        "verse-arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَلْتَنظُرْ نَفْسٌ مَّا قَدَّمَتْ لِغَدٍ ۖ وَاتَّقُوا اللَّهَ ۚ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ",
        "verse-english": "O you who have believed, fear Allah. And let every soul look to what it has put forth for tomorrow - and fear Allah. Indeed, Allah is Acquainted with what you do.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "O you who have believed,"
            },
            {
                "clause": "fear God."
            },
            {
                "clause": "And let every soul look to what it has put forth for tomorrow -"
            },
            {
                "clause": "and fear God."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "God is Acquainted with what you do."
            }
        ]
    },
    "5145": {
        "chapter": 59,
        "verse-number": 19,
        "verse-arabic": "وَلَا تَكُونُوا كَالَّذِينَ نَسُوا اللَّهَ فَأَنسَاهُمْ أَنفُسَهُمْ ۚ أُولَٰئِكَ هُمُ الْفَاسِقُونَ",
        "verse-english": "And be not like those who forgot Allah, so He made them forget themselves. Those are the defiantly disobedient.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And be not like those who forgot God,"
            },
            {
                "clause": "so He made them forget themselves."
            },
            {
                "clause": "Those are the defiantly disobedient."
            }
        ]
    },
    "5146": {
        "chapter": 59,
        "verse-number": 20,
        "verse-arabic": "لَا يَسْتَوِي أَصْحَابُ النَّارِ وَأَصْحَابُ الْجَنَّةِ ۚ أَصْحَابُ الْجَنَّةِ هُمُ الْفَائِزُونَ",
        "verse-english": "Not equal are the companions of the Fire and the companions of Paradise. The companions of Paradise - they are the attainers [of success].",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Not equal are the companions of the Fire and the companions of Paradise."
            },
            {
                "clause": "The companions of Paradise -"
            },
            {
                "clause": "they are the attainers [of success]."
            }
        ]
    },
    "5147": {
        "chapter": 59,
        "verse-number": 21,
        "verse-arabic": "لَوْ أَنزَلْنَا هَٰذَا الْقُرْآنَ عَلَىٰ جَبَلٍ لَّرَأَيْتَهُ خَاشِعًا مُّتَصَدِّعًا مِّنْ خَشْيَةِ اللَّهِ ۚ وَتِلْكَ الْأَمْثَالُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ",
        "verse-english": "If We had sent down this Qur'an upon a mountain, you would have seen it humbled and coming apart from fear of Allah. And these examples We present to the people that perhaps they will give thought.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "If We had sent down this Qur'an upon a mountain,"
            },
            {
                "clause": "you would have seen it humbled and coming apart from fear of God."
            },
            {
                "clause": "And these examples We present to the people that perhaps they will give thought."
            }
        ]
    },
    "5148": {
        "chapter": 59,
        "verse-number": 22,
        "verse-arabic": "هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ ۖ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ ۖ هُوَ الرَّحْمَٰنُ الرَّحِيمُ",
        "verse-english": "He is Allah, other than whom there is no deity, Knower of the unseen and the witnessed. He is the Entirely Merciful, the Especially Merciful.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "He is God,"
            },
            {
                "clause": "other than whom there is no deity,"
            },
            {
                "clause": "Knower of the unseen and the witnessed."
            },
            {
                "clause": "He is the Entirely Merciful,"
            },
            {
                "clause": "the Especially Merciful."
            }
        ]
    },
    "5149": {
        "chapter": 59,
        "verse-number": 23,
        "verse-arabic": "هُوَ اللَّهُ الَّذِي لَا إِلَٰهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ ۚ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ",
        "verse-english": "He is Allah, other than whom there is no deity, the Sovereign, the Pure, the Perfection, the Bestower of Faith, the Overseer, the Exalted in Might, the Compeller, the Superior. Exalted is Allah above whatever they associate with Him.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "He is God,"
            },
            {
                "clause": "other than whom there is no deity,"
            },
            {
                "clause": "the Sovereign,"
            },
            {
                "clause": "the Pure,"
            },
            {
                "clause": "the Perfection,"
            },
            {
                "clause": "the Bestower of Faith,"
            },
            {
                "clause": "the Overseer,"
            },
            {
                "clause": "the Exalted in Might,"
            },
            {
                "clause": "the Compeller,"
            },
            {
                "clause": "the Superior."
            },
            {
                "clause": "Exalted is God above whatever they associate with Him."
            }
        ]
    },
    "5150": {
        "chapter": 59,
        "verse-number": 24,
        "verse-arabic": "هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ ۖ لَهُ الْأَسْمَاءُ الْحُسْنَىٰ ۚ يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
        "verse-english": "He is Allah, the Creator, the Inventor, the Fashioner; to Him belong the best names. Whatever is in the heavens and earth is exalting Him. And He is the Exalted in Might, the Wise.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "He is God,"
            },
            {
                "clause": "the Creator,"
            },
            {
                "clause": "the Inventor,"
            },
            {
                "clause": "the Fashioner;"
            },
            {
                "clause": "to Him belong the best names."
            },
            {
                "clause": "Whatever is in the heavens and earth is exalting Him."
            },
            {
                "clause": "And He is the Exalted in Might,"
            },
            {
                "clause": "the Wise."
            }
        ]
    }
}