{
    "1236": {
        "chapter": 9,
        "verse-number": 1,
        "verse-arabic": "بَرَاءَةٌ مِّنَ اللَّهِ وَرَسُولِهِ إِلَى الَّذِينَ عَاهَدتُّم مِّنَ الْمُشْرِكِينَ",
        "verse-english": "[This is a declaration of] disassociation, from Allah and His Messenger, to those with whom you had made a treaty among the polytheists.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "[This is a declaration of] disassociation,"
            },
            {
                "clause": "from God and His Messenger,"
            },
            {
                "clause": "to those with whom you had made a treaty among the polytheists."
            }
        ]
    },
    "1237": {
        "chapter": 9,
        "verse-number": 2,
        "verse-arabic": "فَسِيحُوا فِي الْأَرْضِ أَرْبَعَةَ أَشْهُرٍ وَاعْلَمُوا أَنَّكُمْ غَيْرُ مُعْجِزِي اللَّهِ ۙ وَأَنَّ اللَّهَ مُخْزِي الْكَافِرِينَ",
        "verse-english": "So travel freely, [O disbelievers], throughout the land [during] four months but know that you cannot cause failure to Allah and that Allah will disgrace the disbelievers.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "So travel freely,"
            },
            {
                "clause": "[O disbelievers],"
            },
            {
                "clause": "throughout the land [during] four months but know that you cannot cause failure to God and that God will disgrace the disbelievers."
            }
        ]
    },
    "1238": {
        "chapter": 9,
        "verse-number": 3,
        "verse-arabic": "وَأَذَانٌ مِّنَ اللَّهِ وَرَسُولِهِ إِلَى النَّاسِ يَوْمَ الْحَجِّ الْأَكْبَرِ أَنَّ اللَّهَ بَرِيءٌ مِّنَ الْمُشْرِكِينَ ۙ وَرَسُولُهُ ۚ فَإِن تُبْتُمْ فَهُوَ خَيْرٌ لَّكُمْ ۖ وَإِن تَوَلَّيْتُمْ فَاعْلَمُوا أَنَّكُمْ غَيْرُ مُعْجِزِي اللَّهِ ۗ وَبَشِّرِ الَّذِينَ كَفَرُوا بِعَذَابٍ أَلِيمٍ",
        "verse-english": "And [it is] an announcement from Allah and His Messenger to the people on the day of the greater pilgrimage that Allah is disassociated from the disbelievers, and [so is] His Messenger. So if you repent, that is best for you; but if you turn away - then know that you will not cause failure to Allah. And give tidings to those who disbelieve of a painful punishment.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And [it is] an announcement from God and His Messenger to the people on the day of the greater pilgrimage that God is disassociated from the disbelievers,"
            },
            {
                "clause": "and [so is] His Messenger."
            },
            {
                "clause": "So if you repent,"
            },
            {
                "clause": "that is best for you;"
            },
            {
                "clause": "but if you turn away -"
            },
            {
                "clause": "then know that you will not cause failure to God."
            },
            {
                "clause": "And give tidings to those who disbelieve of a painful punishment."
            }
        ]
    },
    "1239": {
        "chapter": 9,
        "verse-number": 4,
        "verse-arabic": "إِلَّا الَّذِينَ عَاهَدتُّم مِّنَ الْمُشْرِكِينَ ثُمَّ لَمْ يَنقُصُوكُمْ شَيْئًا وَلَمْ يُظَاهِرُوا عَلَيْكُمْ أَحَدًا فَأَتِمُّوا إِلَيْهِمْ عَهْدَهُمْ إِلَىٰ مُدَّتِهِمْ ۚ إِنَّ اللَّهَ يُحِبُّ الْمُتَّقِينَ",
        "verse-english": "Excepted are those with whom you made a treaty among the polytheists and then they have not been deficient toward you in anything or supported anyone against you; so complete for them their treaty until their term [has ended]. Indeed, Allah loves the righteous [who fear Him].",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Excepted are those with whom you made a treaty among the polytheists and then they have not been deficient toward you in anything or supported anyone against you;"
            },
            {
                "clause": "so complete for them their treaty until their term [has ended]."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "God loves the righteous [who fear Him]."
            }
        ]
    },
    "1240": {
        "chapter": 9,
        "verse-number": 5,
        "verse-arabic": "فَإِذَا انسَلَخَ الْأَشْهُرُ الْحُرُمُ فَاقْتُلُوا الْمُشْرِكِينَ حَيْثُ وَجَدتُّمُوهُمْ وَخُذُوهُمْ وَاحْصُرُوهُمْ وَاقْعُدُوا لَهُمْ كُلَّ مَرْصَدٍ ۚ فَإِن تَابُوا وَأَقَامُوا الصَّلَاةَ وَآتَوُا الزَّكَاةَ فَخَلُّوا سَبِيلَهُمْ ۚ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ",
        "verse-english": "And when the sacred months have passed, then kill the polytheists wherever you find them and capture them and besiege them and sit in wait for them at every place of ambush. But if they should repent, establish prayer, and give zakah, let them [go] on their way. Indeed, Allah is Forgiving and Merciful.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And when the sacred months have passed,"
            },
            {
                "clause": "then kill the polytheists wherever you find them and capture them and besiege them and sit in wait for them at every place of ambush."
            },
            {
                "clause": "But if they should repent,"
            },
            {
                "clause": "establish prayer,"
            },
            {
                "clause": "and give zakah,"
            },
            {
                "clause": "let them [go] on their way."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "God is Forgiving and Merciful."
            }
        ]
    },
    "1241": {
        "chapter": 9,
        "verse-number": 6,
        "verse-arabic": "وَإِنْ أَحَدٌ مِّنَ الْمُشْرِكِينَ اسْتَجَارَكَ فَأَجِرْهُ حَتَّىٰ يَسْمَعَ كَلَامَ اللَّهِ ثُمَّ أَبْلِغْهُ مَأْمَنَهُ ۚ ذَٰلِكَ بِأَنَّهُمْ قَوْمٌ لَّا يَعْلَمُونَ",
        "verse-english": "And if any one of the polytheists seeks your protection, then grant him protection so that he may hear the words of Allah. Then deliver him to his place of safety. That is because they are a people who do not know.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And if any one of the polytheists seeks your protection,"
            },
            {
                "clause": "then grant him protection so that he may hear the words of God."
            },
            {
                "clause": "Then deliver him to his place of safety."
            },
            {
                "clause": "That is because they are a people who do not know."
            }
        ]
    },
    "1242": {
        "chapter": 9,
        "verse-number": 7,
        "verse-arabic": "كَيْفَ يَكُونُ لِلْمُشْرِكِينَ عَهْدٌ عِندَ اللَّهِ وَعِندَ رَسُولِهِ إِلَّا الَّذِينَ عَاهَدتُّمْ عِندَ الْمَسْجِدِ الْحَرَامِ ۖ فَمَا اسْتَقَامُوا لَكُمْ فَاسْتَقِيمُوا لَهُمْ ۚ إِنَّ اللَّهَ يُحِبُّ الْمُتَّقِينَ",
        "verse-english": "How can there be for the polytheists a treaty in the sight of Allah and with His Messenger, except for those with whom you made a treaty at al-Masjid al-Haram? So as long as they are upright toward you, be upright toward them. Indeed, Allah loves the righteous [who fear Him].",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "How can there be for the polytheists a treaty in the sight of God and with His Messenger,"
            },
            {
                "clause": "except for those with whom you made a treaty at al-"
            },
            {
                "clause": "Masjid al-"
            },
            {
                "clause": "Haram?"
            },
            {
                "clause": "So as long as they are upright toward you,"
            },
            {
                "clause": "be upright toward them."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "God loves the righteous [who fear Him]."
            }
        ]
    },
    "1243": {
        "chapter": 9,
        "verse-number": 8,
        "verse-arabic": "كَيْفَ وَإِن يَظْهَرُوا عَلَيْكُمْ لَا يَرْقُبُوا فِيكُمْ إِلًّا وَلَا ذِمَّةً ۚ يُرْضُونَكُم بِأَفْوَاهِهِمْ وَتَأْبَىٰ قُلُوبُهُمْ وَأَكْثَرُهُمْ فَاسِقُونَ",
        "verse-english": "How [can there be a treaty] while, if they gain dominance over you, they do not observe concerning you any pact of kinship or covenant of protection? They satisfy you with their mouths, but their hearts refuse [compliance], and most of them are defiantly disobedient.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "How [can there be a treaty] while,"
            },
            {
                "clause": "if they gain dominance over you,"
            },
            {
                "clause": "they do not observe concerning you any pact of kinship or covenant of protection?"
            },
            {
                "clause": "They satisfy you with their mouths,"
            },
            {
                "clause": "but their hearts refuse [compliance],"
            },
            {
                "clause": "and most of them are defiantly disobedient."
            }
        ]
    },
    "1244": {
        "chapter": 9,
        "verse-number": 9,
        "verse-arabic": "اشْتَرَوْا بِآيَاتِ اللَّهِ ثَمَنًا قَلِيلًا فَصَدُّوا عَن سَبِيلِهِ ۚ إِنَّهُمْ سَاءَ مَا كَانُوا يَعْمَلُونَ",
        "verse-english": "They have exchanged the signs of Allah for a small price and averted [people] from His way. Indeed, it was evil that they were doing.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "They have exchanged the signs of God for a small price and averted [people] from His way."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "it was evil that they were doing."
            }
        ]
    },
    "1245": {
        "chapter": 9,
        "verse-number": 10,
        "verse-arabic": "لَا يَرْقُبُونَ فِي مُؤْمِنٍ إِلًّا وَلَا ذِمَّةً ۚ وَأُولَٰئِكَ هُمُ الْمُعْتَدُونَ",
        "verse-english": "They do not observe toward a believer any pact of kinship or covenant of protection. And it is they who are the transgressors.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "They do not observe toward a believer any pact of kinship or covenant of protection."
            },
            {
                "clause": "And it is they who are the transgressors."
            }
        ]
    },
    "1246": {
        "chapter": 9,
        "verse-number": 11,
        "verse-arabic": "فَإِن تَابُوا وَأَقَامُوا الصَّلَاةَ وَآتَوُا الزَّكَاةَ فَإِخْوَانُكُمْ فِي الدِّينِ ۗ وَنُفَصِّلُ الْآيَاتِ لِقَوْمٍ يَعْلَمُونَ",
        "verse-english": "But if they repent, establish prayer, and give zakah, then they are your brothers in religion; and We detail the verses for a people who know.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "But if they repent,"
            },
            {
                "clause": "establish prayer,"
            },
            {
                "clause": "and give zakah,"
            },
            {
                "clause": "then they are your brothers in religion;"
            },
            {
                "clause": "and We detail the verses for a people who know."
            }
        ]
    },
    "1247": {
        "chapter": 9,
        "verse-number": 12,
        "verse-arabic": "وَإِن نَّكَثُوا أَيْمَانَهُم مِّن بَعْدِ عَهْدِهِمْ وَطَعَنُوا فِي دِينِكُمْ فَقَاتِلُوا أَئِمَّةَ الْكُفْرِ ۙ إِنَّهُمْ لَا أَيْمَانَ لَهُمْ لَعَلَّهُمْ يَنتَهُونَ",
        "verse-english": "And if they break their oaths after their treaty and defame your religion, then fight the leaders of disbelief, for indeed, there are no oaths [sacred] to them; [fight them that] they might cease.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And if they break their oaths after their treaty and defame your religion,"
            },
            {
                "clause": "then fight the leaders of disbelief,"
            },
            {
                "clause": "for indeed,"
            },
            {
                "clause": "there are no oaths [sacred] to them;"
            },
            {
                "clause": "[fight them that] they might cease."
            }
        ]
    },
    "1248": {
        "chapter": 9,
        "verse-number": 13,
        "verse-arabic": "أَلَا تُقَاتِلُونَ قَوْمًا نَّكَثُوا أَيْمَانَهُمْ وَهَمُّوا بِإِخْرَاجِ الرَّسُولِ وَهُم بَدَءُوكُمْ أَوَّلَ مَرَّةٍ ۚ أَتَخْشَوْنَهُمْ ۚ فَاللَّهُ أَحَقُّ أَن تَخْشَوْهُ إِن كُنتُم مُّؤْمِنِينَ",
        "verse-english": "Would you not fight a people who broke their oaths and determined to expel the Messenger, and they had begun [the attack upon] you the first time? Do you fear them? But Allah has more right that you should fear Him, if you are [truly] believers.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Would you not fight a people who broke their oaths and determined to expel the Messenger,"
            },
            {
                "clause": "and they had begun [the attack upon] you the first time?"
            },
            {
                "clause": "Do you fear them?"
            },
            {
                "clause": "But God has more right that you should fear Him,"
            },
            {
                "clause": "if you are [truly] believers."
            }
        ]
    },
    "1249": {
        "chapter": 9,
        "verse-number": 14,
        "verse-arabic": "قَاتِلُوهُمْ يُعَذِّبْهُمُ اللَّهُ بِأَيْدِيكُمْ وَيُخْزِهِمْ وَيَنصُرْكُمْ عَلَيْهِمْ وَيَشْفِ صُدُورَ قَوْمٍ مُّؤْمِنِينَ",
        "verse-english": "Fight them; Allah will punish them by your hands and will disgrace them and give you victory over them and satisfy the breasts of a believing people",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Fight them;"
            },
            {
                "clause": "God will punish them by your hands and will disgrace them and give you victory over them and satisfy the breasts of a believing people"
            }
        ]
    },
    "1250": {
        "chapter": 9,
        "verse-number": 15,
        "verse-arabic": "وَيُذْهِبْ غَيْظَ قُلُوبِهِمْ ۗ وَيَتُوبُ اللَّهُ عَلَىٰ مَن يَشَاءُ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ",
        "verse-english": "And remove the fury in the believers' hearts. And Allah turns in forgiveness to whom He wills; and Allah is Knowing and Wise.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And remove the fury in the believers' hearts."
            },
            {
                "clause": "And God turns in forgiveness to whom He wills;"
            },
            {
                "clause": "and God is Knowing and Wise."
            }
        ]
    },
    "1251": {
        "chapter": 9,
        "verse-number": 16,
        "verse-arabic": "أَمْ حَسِبْتُمْ أَن تُتْرَكُوا وَلَمَّا يَعْلَمِ اللَّهُ الَّذِينَ جَاهَدُوا مِنكُمْ وَلَمْ يَتَّخِذُوا مِن دُونِ اللَّهِ وَلَا رَسُولِهِ وَلَا الْمُؤْمِنِينَ وَلِيجَةً ۚ وَاللَّهُ خَبِيرٌ بِمَا تَعْمَلُونَ",
        "verse-english": "Do you think that you will be left [as you are] while Allah has not yet made evident those among you who strive [for His cause] and do not take other than Allah, His Messenger and the believers as intimates? And Allah is Acquainted with what you do.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Do you think that you will be left [as you are] while God has not yet made evident those among you who strive [for His cause] and do not take other than God,"
            },
            {
                "clause": "His Messenger and the believers as intimates?"
            },
            {
                "clause": "And God is Acquainted with what you do."
            }
        ]
    },
    "1252": {
        "chapter": 9,
        "verse-number": 17,
        "verse-arabic": "مَا كَانَ لِلْمُشْرِكِينَ أَن يَعْمُرُوا مَسَاجِدَ اللَّهِ شَاهِدِينَ عَلَىٰ أَنفُسِهِم بِالْكُفْرِ ۚ أُولَٰئِكَ حَبِطَتْ أَعْمَالُهُمْ وَفِي النَّارِ هُمْ خَالِدُونَ",
        "verse-english": "It is not for the polytheists to maintain the mosques of Allah [while] witnessing against themselves with disbelief. [For] those, their deeds have become worthless, and in the Fire they will abide eternally.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "It is not for the polytheists to maintain the mosques of God [while] witnessing against themselves with disbelief."
            },
            {
                "clause": "[For] those,"
            },
            {
                "clause": "their deeds have become worthless,"
            },
            {
                "clause": "and in the Fire they will abide eternally."
            }
        ]
    },
    "1253": {
        "chapter": 9,
        "verse-number": 18,
        "verse-arabic": "إِنَّمَا يَعْمُرُ مَسَاجِدَ اللَّهِ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَأَقَامَ الصَّلَاةَ وَآتَى الزَّكَاةَ وَلَمْ يَخْشَ إِلَّا اللَّهَ ۖ فَعَسَىٰ أُولَٰئِكَ أَن يَكُونُوا مِنَ الْمُهْتَدِينَ",
        "verse-english": "The mosques of Allah are only to be maintained by those who believe in Allah and the Last Day and establish prayer and give zakah and do not fear except Allah, for it is expected that those will be of the [rightly] guided.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "The mosques of God are only to be maintained by those who believe in God and the Last Day and establish prayer and give zakah and do not fear except God,"
            },
            {
                "clause": "for it is expected that those will be of the [rightly] guided."
            }
        ]
    },
    "1254": {
        "chapter": 9,
        "verse-number": 19,
        "verse-arabic": "۞ أَجَعَلْتُمْ سِقَايَةَ الْحَاجِّ وَعِمَارَةَ الْمَسْجِدِ الْحَرَامِ كَمَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَجَاهَدَ فِي سَبِيلِ اللَّهِ ۚ لَا يَسْتَوُونَ عِندَ اللَّهِ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ",
        "verse-english": "Have you made the providing of water for the pilgrim and the maintenance of al-Masjid al-Haram equal to [the deeds of] one who believes in Allah and the Last Day and strives in the cause of Allah? They are not equal in the sight of Allah. And Allah does not guide the wrongdoing people.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Have you made the providing of water for the pilgrim and the maintenance of al-"
            },
            {
                "clause": "Masjid al-"
            },
            {
                "clause": "Haram equal to [the deeds of] one who believes in God and the Last Day and strives in the cause of God?"
            },
            {
                "clause": "They are not equal in the sight of God."
            },
            {
                "clause": "And God does not guide the wrongdoing people."
            }
        ]
    },
    "1255": {
        "chapter": 9,
        "verse-number": 20,
        "verse-arabic": "الَّذِينَ آمَنُوا وَهَاجَرُوا وَجَاهَدُوا فِي سَبِيلِ اللَّهِ بِأَمْوَالِهِمْ وَأَنفُسِهِمْ أَعْظَمُ دَرَجَةً عِندَ اللَّهِ ۚ وَأُولَٰئِكَ هُمُ الْفَائِزُونَ",
        "verse-english": "The ones who have believed, emigrated and striven in the cause of Allah with their wealth and their lives are greater in rank in the sight of Allah. And it is those who are the attainers [of success].",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "The ones who have believed,"
            },
            {
                "clause": "emigrated and striven in the cause of God with their wealth and their lives are greater in rank in the sight of God."
            },
            {
                "clause": "And it is those who are the attainers [of success]."
            }
        ]
    },
    "1256": {
        "chapter": 9,
        "verse-number": 21,
        "verse-arabic": "يُبَشِّرُهُمْ رَبُّهُم بِرَحْمَةٍ مِّنْهُ وَرِضْوَانٍ وَجَنَّاتٍ لَّهُمْ فِيهَا نَعِيمٌ مُّقِيمٌ",
        "verse-english": "Their Lord gives them good tidings of mercy from Him and approval and of gardens for them wherein is enduring pleasure.",
        "clauses-arabic": [
            {
                "clause": "يُبَشِّرُهُمْ رَبُّهُم بِرَحْمَةٍ مِّنْهُ وَرِضْوَانٍ وَجَنَّاتٍ لَّهُمْ فِيهَا نَعِيمٌ مُّقِيمٌ"
            }
        ],
        "clauses-english": [
            {
                "clause": "Their Lord gives them good tidings of mercy from Him and approval and of gardens for them wherein is enduring pleasure."
            }
        ]
    },
    "1257": {
        "chapter": 9,
        "verse-number": 22,
        "verse-arabic": "خَالِدِينَ فِيهَا أَبَدًا ۚ إِنَّ اللَّهَ عِندَهُ أَجْرٌ عَظِيمٌ",
        "verse-english": "[They will be] abiding therein forever. Indeed, Allah has with Him a great reward.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "[They will be] abiding therein forever."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "God has with Him a great reward."
            }
        ]
    },
    "1258": {
        "chapter": 9,
        "verse-number": 23,
        "verse-arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا آبَاءَكُمْ وَإِخْوَانَكُمْ أَوْلِيَاءَ إِنِ اسْتَحَبُّوا الْكُفْرَ عَلَى الْإِيمَانِ ۚ وَمَن يَتَوَلَّهُم مِّنكُمْ فَأُولَٰئِكَ هُمُ الظَّالِمُونَ",
        "verse-english": "O you who have believed, do not take your fathers or your brothers as allies if they have preferred disbelief over belief. And whoever does so among you - then it is those who are the wrongdoers.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "O you who have believed,"
            },
            {
                "clause": "do not take your fathers or your brothers as allies if they have preferred disbelief over belief."
            },
            {
                "clause": "And whoever does so among you -"
            },
            {
                "clause": "then it is those who are the wrongdoers."
            }
        ]
    },
    "1259": {
        "chapter": 9,
        "verse-number": 24,
        "verse-arabic": "قُلْ إِن كَانَ آبَاؤُكُمْ وَأَبْنَاؤُكُمْ وَإِخْوَانُكُمْ وَأَزْوَاجُكُمْ وَعَشِيرَتُكُمْ وَأَمْوَالٌ اقْتَرَفْتُمُوهَا وَتِجَارَةٌ تَخْشَوْنَ كَسَادَهَا وَمَسَاكِنُ تَرْضَوْنَهَا أَحَبَّ إِلَيْكُم مِّنَ اللَّهِ وَرَسُولِهِ وَجِهَادٍ فِي سَبِيلِهِ فَتَرَبَّصُوا حَتَّىٰ يَأْتِيَ اللَّهُ بِأَمْرِهِ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ",
        "verse-english": "Say, [O Muhammad], \"If your fathers, your sons, your brothers, your wives, your relatives, wealth which you have obtained, commerce wherein you fear decline, and dwellings with which you are pleased are more beloved to you than Allah and His Messenger and jihad in His cause, then wait until Allah executes His command. And Allah does not guide the defiantly disobedient people.\"",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Say,"
            },
            {
                "clause": "[O Muhammad],"
            },
            {
                "clause": "\"If your fathers,"
            },
            {
                "clause": "your sons,"
            },
            {
                "clause": "your brothers,"
            },
            {
                "clause": "your wives,"
            },
            {
                "clause": "your relatives,"
            },
            {
                "clause": "wealth which you have obtained,"
            },
            {
                "clause": "commerce wherein you fear decline,"
            },
            {
                "clause": "and dwellings with which you are pleased are more beloved to you than God and His Messenger and jihad in His cause,"
            },
            {
                "clause": "then wait until God executes His command."
            },
            {
                "clause": "And God does not guide the defiantly disobedient people."
            },
            {
                "clause": "\""
            }
        ]
    },
    "1260": {
        "chapter": 9,
        "verse-number": 25,
        "verse-arabic": "لَقَدْ نَصَرَكُمُ اللَّهُ فِي مَوَاطِنَ كَثِيرَةٍ ۙ وَيَوْمَ حُنَيْنٍ ۙ إِذْ أَعْجَبَتْكُمْ كَثْرَتُكُمْ فَلَمْ تُغْنِ عَنكُمْ شَيْئًا وَضَاقَتْ عَلَيْكُمُ الْأَرْضُ بِمَا رَحُبَتْ ثُمَّ وَلَّيْتُم مُّدْبِرِينَ",
        "verse-english": "Allah has already given you victory in many regions and [even] on the day of Hunayn, when your great number pleased you, but it did not avail you at all, and the earth was confining for you with its vastness; then you turned back, fleeing.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "God has already given you victory in many regions and [even] on the day of Hunayn,"
            },
            {
                "clause": "when your great number pleased you,"
            },
            {
                "clause": "but it did not avail you at all,"
            },
            {
                "clause": "and the earth was confining for you with its vastness;"
            },
            {
                "clause": "then you turned back,"
            },
            {
                "clause": "fleeing."
            }
        ]
    },
    "1261": {
        "chapter": 9,
        "verse-number": 26,
        "verse-arabic": "ثُمَّ أَنزَلَ اللَّهُ سَكِينَتَهُ عَلَىٰ رَسُولِهِ وَعَلَى الْمُؤْمِنِينَ وَأَنزَلَ جُنُودًا لَّمْ تَرَوْهَا وَعَذَّبَ الَّذِينَ كَفَرُوا ۚ وَذَٰلِكَ جَزَاءُ الْكَافِرِينَ",
        "verse-english": "Then Allah sent down His tranquillity upon His Messenger and upon the believers and sent down soldiers angels whom you did not see and punished those who disbelieved. And that is the recompense of the disbelievers.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Then God sent down His tranquillity upon His Messenger and upon the believers and sent down soldiers angels whom you did not see and punished those who disbelieved."
            },
            {
                "clause": "And that is the recompense of the disbelievers."
            }
        ]
    },
    "1262": {
        "chapter": 9,
        "verse-number": 27,
        "verse-arabic": "ثُمَّ يَتُوبُ اللَّهُ مِن بَعْدِ ذَٰلِكَ عَلَىٰ مَن يَشَاءُ ۗ وَاللَّهُ غَفُورٌ رَّحِيمٌ",
        "verse-english": "Then Allah will accept repentance after that for whom He wills; and Allah is Forgiving and Merciful.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Then God will accept repentance after that for whom He wills;"
            },
            {
                "clause": "and God is Forgiving and Merciful."
            }
        ]
    },
    "1263": {
        "chapter": 9,
        "verse-number": 28,
        "verse-arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّمَا الْمُشْرِكُونَ نَجَسٌ فَلَا يَقْرَبُوا الْمَسْجِدَ الْحَرَامَ بَعْدَ عَامِهِمْ هَٰذَا ۚ وَإِنْ خِفْتُمْ عَيْلَةً فَسَوْفَ يُغْنِيكُمُ اللَّهُ مِن فَضْلِهِ إِن شَاءَ ۚ إِنَّ اللَّهَ عَلِيمٌ حَكِيمٌ",
        "verse-english": "O you who have believed, indeed the polytheists are unclean, so let them not approach al-Masjid al-Haram after this, their [final] year. And if you fear privation, Allah will enrich you from His bounty if He wills. Indeed, Allah is Knowing and Wise.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "O you who have believed,"
            },
            {
                "clause": "indeed the polytheists are unclean,"
            },
            {
                "clause": "so let them not approach al-"
            },
            {
                "clause": "Masjid al-"
            },
            {
                "clause": "Haram after this,"
            },
            {
                "clause": "their [final] year."
            },
            {
                "clause": "And if you fear privation,"
            },
            {
                "clause": "God will enrich you from His bounty if He wills."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "God is Knowing and Wise."
            }
        ]
    },
    "1264": {
        "chapter": 9,
        "verse-number": 29,
        "verse-arabic": "قَاتِلُوا الَّذِينَ لَا يُؤْمِنُونَ بِاللَّهِ وَلَا بِالْيَوْمِ الْآخِرِ وَلَا يُحَرِّمُونَ مَا حَرَّمَ اللَّهُ وَرَسُولُهُ وَلَا يَدِينُونَ دِينَ الْحَقِّ مِنَ الَّذِينَ أُوتُوا الْكِتَابَ حَتَّىٰ يُعْطُوا الْجِزْيَةَ عَن يَدٍ وَهُمْ صَاغِرُونَ",
        "verse-english": "Fight those who do not believe in Allah or in the Last Day and who do not consider unlawful what Allah and His Messenger have made unlawful and who do not adopt the religion of truth from those who were given the Scripture - [fight] until they give the jizyah willingly while they are humbled.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Fight those who do not believe in God or in the Last Day and who do not consider unlawful what God and His Messenger have made unlawful and who do not adopt the religion of truth from those who were given the Scripture -"
            },
            {
                "clause": "[fight] until they give the jizyah willingly while they are humbled."
            }
        ]
    },
    "1265": {
        "chapter": 9,
        "verse-number": 30,
        "verse-arabic": "وَقَالَتِ الْيَهُودُ عُزَيْرٌ ابْنُ اللَّهِ وَقَالَتِ النَّصَارَى الْمَسِيحُ ابْنُ اللَّهِ ۖ ذَٰلِكَ قَوْلُهُم بِأَفْوَاهِهِمْ ۖ يُضَاهِئُونَ قَوْلَ الَّذِينَ كَفَرُوا مِن قَبْلُ ۚ قَاتَلَهُمُ اللَّهُ ۚ أَنَّىٰ يُؤْفَكُونَ",
        "verse-english": "The Jews say, \"Ezra is the son of Allah \"; and the Christians say, \"The Messiah is the son of Allah.\" That is their statement from their mouths; they imitate the saying of those who disbelieved [before them]. May Allah destroy them; how are they deluded?",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "The Jews say,"
            },
            {
                "clause": "\"Ezra is the son of God \";"
            },
            {
                "clause": "and the Christians say,"
            },
            {
                "clause": "\"The Messiah is the son of God."
            },
            {
                "clause": "\" That is their statement from their mouths;"
            },
            {
                "clause": "they imitate the saying of those who disbelieved [before them]."
            },
            {
                "clause": "May God destroy them;"
            },
            {
                "clause": "how are they deluded?"
            }
        ]
    },
    "1266": {
        "chapter": 9,
        "verse-number": 31,
        "verse-arabic": "اتَّخَذُوا أَحْبَارَهُمْ وَرُهْبَانَهُمْ أَرْبَابًا مِّن دُونِ اللَّهِ وَالْمَسِيحَ ابْنَ مَرْيَمَ وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا إِلَٰهًا وَاحِدًا ۖ لَّا إِلَٰهَ إِلَّا هُوَ ۚ سُبْحَانَهُ عَمَّا يُشْرِكُونَ",
        "verse-english": "They have taken their scholars and monks as lords besides Allah, and [also] the Messiah, the son of Mary. And they were not commanded except to worship one God; there is no deity except Him. Exalted is He above whatever they associate with Him.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "They have taken their scholars and monks as lords besides God,"
            },
            {
                "clause": "and [also] the Messiah,"
            },
            {
                "clause": "the son of Mary."
            },
            {
                "clause": "And they were not commanded except to worship one God;"
            },
            {
                "clause": "there is no deity except Him."
            },
            {
                "clause": "Exalted is He above whatever they associate with Him."
            }
        ]
    },
    "1267": {
        "chapter": 9,
        "verse-number": 32,
        "verse-arabic": "يُرِيدُونَ أَن يُطْفِئُوا نُورَ اللَّهِ بِأَفْوَاهِهِمْ وَيَأْبَى اللَّهُ إِلَّا أَن يُتِمَّ نُورَهُ وَلَوْ كَرِهَ الْكَافِرُونَ",
        "verse-english": "They want to extinguish the light of Allah with their mouths, but Allah refuses except to perfect His light, although the disbelievers dislike it.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "They want to extinguish the light of God with their mouths,"
            },
            {
                "clause": "but God refuses except to perfect His light,"
            },
            {
                "clause": "although the disbelievers dislike it."
            }
        ]
    },
    "1268": {
        "chapter": 9,
        "verse-number": 33,
        "verse-arabic": "هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَىٰ وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ",
        "verse-english": "It is He who has sent His Messenger with guidance and the religion of truth to manifest it over all religion, although they who associate others with Allah dislike it.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "It is He who has sent His Messenger with guidance and the religion of truth to manifest it over all religion,"
            },
            {
                "clause": "although they who associate others with God dislike it."
            }
        ]
    },
    "1269": {
        "chapter": 9,
        "verse-number": 34,
        "verse-arabic": "۞ يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّ كَثِيرًا مِّنَ الْأَحْبَارِ وَالرُّهْبَانِ لَيَأْكُلُونَ أَمْوَالَ النَّاسِ بِالْبَاطِلِ وَيَصُدُّونَ عَن سَبِيلِ اللَّهِ ۗ وَالَّذِينَ يَكْنِزُونَ الذَّهَبَ وَالْفِضَّةَ وَلَا يُنفِقُونَهَا فِي سَبِيلِ اللَّهِ فَبَشِّرْهُم بِعَذَابٍ أَلِيمٍ",
        "verse-english": "O you who have believed, indeed many of the scholars and the monks devour the wealth of people unjustly and avert [them] from the way of Allah. And those who hoard gold and silver and spend it not in the way of Allah - give them tidings of a painful punishment.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "O you who have believed,"
            },
            {
                "clause": "indeed many of the scholars and the monks devour the wealth of people unjustly and avert [them] from the way of God."
            },
            {
                "clause": "And those who hoard gold and silver and spend it not in the way of God -"
            },
            {
                "clause": "give them tidings of a painful punishment."
            }
        ]
    },
    "1270": {
        "chapter": 9,
        "verse-number": 35,
        "verse-arabic": "يَوْمَ يُحْمَىٰ عَلَيْهَا فِي نَارِ جَهَنَّمَ فَتُكْوَىٰ بِهَا جِبَاهُهُمْ وَجُنُوبُهُمْ وَظُهُورُهُمْ ۖ هَٰذَا مَا كَنَزْتُمْ لِأَنفُسِكُمْ فَذُوقُوا مَا كُنتُمْ تَكْنِزُونَ",
        "verse-english": "The Day when it will be heated in the fire of Hell and seared therewith will be their foreheads, their flanks, and their backs, [it will be said], \"This is what you hoarded for yourselves, so taste what you used to hoard.\"",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "The Day when it will be heated in the fire of Hell and seared therewith will be their foreheads,"
            },
            {
                "clause": "their flanks,"
            },
            {
                "clause": "and their backs,"
            },
            {
                "clause": "[it will be said],"
            },
            {
                "clause": "\"This is what you hoarded for yourselves,"
            },
            {
                "clause": "so taste what you used to hoard."
            },
            {
                "clause": "\""
            }
        ]
    },
    "1271": {
        "chapter": 9,
        "verse-number": 36,
        "verse-arabic": "إِنَّ عِدَّةَ الشُّهُورِ عِندَ اللَّهِ اثْنَا عَشَرَ شَهْرًا فِي كِتَابِ اللَّهِ يَوْمَ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ مِنْهَا أَرْبَعَةٌ حُرُمٌ ۚ ذَٰلِكَ الدِّينُ الْقَيِّمُ ۚ فَلَا تَظْلِمُوا فِيهِنَّ أَنفُسَكُمْ ۚ وَقَاتِلُوا الْمُشْرِكِينَ كَافَّةً كَمَا يُقَاتِلُونَكُمْ كَافَّةً ۚ وَاعْلَمُوا أَنَّ اللَّهَ مَعَ الْمُتَّقِينَ",
        "verse-english": "Indeed, the number of months with Allah is twelve [lunar] months in the register of Allah [from] the day He created the heavens and the earth; of these, four are sacred. That is the correct religion, so do not wrong yourselves during them. And fight against the disbelievers collectively as they fight against you collectively. And know that Allah is with the righteous [who fear Him].",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Indeed,"
            },
            {
                "clause": "the number of months with God is twelve [lunar] months in the register of God [from] the day He created the heavens and the earth;"
            },
            {
                "clause": "of these,"
            },
            {
                "clause": "four are sacred."
            },
            {
                "clause": "That is the correct religion,"
            },
            {
                "clause": "so do not wrong yourselves during them."
            },
            {
                "clause": "And fight against the disbelievers collectively as they fight against you collectively."
            },
            {
                "clause": "And know that God is with the righteous [who fear Him]."
            }
        ]
    },
    "1272": {
        "chapter": 9,
        "verse-number": 37,
        "verse-arabic": "إِنَّمَا النَّسِيءُ زِيَادَةٌ فِي الْكُفْرِ ۖ يُضَلُّ بِهِ الَّذِينَ كَفَرُوا يُحِلُّونَهُ عَامًا وَيُحَرِّمُونَهُ عَامًا لِّيُوَاطِئُوا عِدَّةَ مَا حَرَّمَ اللَّهُ فَيُحِلُّوا مَا حَرَّمَ اللَّهُ ۚ زُيِّنَ لَهُمْ سُوءُ أَعْمَالِهِمْ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْكَافِرِينَ",
        "verse-english": "Indeed, the postponing [of restriction within sacred months] is an increase in disbelief by which those who have disbelieved are led [further] astray. They make it lawful one year and unlawful another year to correspond to the number made unlawful by Allah and [thus] make lawful what Allah has made unlawful. Made pleasing to them is the evil of their deeds; and Allah does not guide the disbelieving people.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Indeed,"
            },
            {
                "clause": "the postponing [of restriction within sacred months] is an increase in disbelief by which those who have disbelieved are led [further] astray."
            },
            {
                "clause": "They make it lawful one year and unlawful another year to correspond to the number made unlawful by God and [thus] make lawful what God has made unlawful."
            },
            {
                "clause": "Made pleasing to them is the evil of their deeds;"
            },
            {
                "clause": "and God does not guide the disbelieving people."
            }
        ]
    },
    "1273": {
        "chapter": 9,
        "verse-number": 38,
        "verse-arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا مَا لَكُمْ إِذَا قِيلَ لَكُمُ انفِرُوا فِي سَبِيلِ اللَّهِ اثَّاقَلْتُمْ إِلَى الْأَرْضِ ۚ أَرَضِيتُم بِالْحَيَاةِ الدُّنْيَا مِنَ الْآخِرَةِ ۚ فَمَا مَتَاعُ الْحَيَاةِ الدُّنْيَا فِي الْآخِرَةِ إِلَّا قَلِيلٌ",
        "verse-english": "O you who have believed, what is [the matter] with you that, when you are told to go forth in the cause of Allah, you adhere heavily to the earth? Are you satisfied with the life of this world rather than the Hereafter? But what is the enjoyment of worldly life compared to the Hereafter except a [very] little.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "O you who have believed,"
            },
            {
                "clause": "what is [the matter] with you that,"
            },
            {
                "clause": "when you are told to go forth in the cause of God,"
            },
            {
                "clause": "you adhere heavily to the earth?"
            },
            {
                "clause": "Are you satisfied with the life of this world rather than the Hereafter?"
            },
            {
                "clause": "But what is the enjoyment of worldly life compared to the Hereafter except a [very] little."
            }
        ]
    },
    "1274": {
        "chapter": 9,
        "verse-number": 39,
        "verse-arabic": "إِلَّا تَنفِرُوا يُعَذِّبْكُمْ عَذَابًا أَلِيمًا وَيَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ وَلَا تَضُرُّوهُ شَيْئًا ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
        "verse-english": "If you do not go forth, He will punish you with a painful punishment and will replace you with another people, and you will not harm Him at all. And Allah is over all things competent.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "If you do not go forth,"
            },
            {
                "clause": "He will punish you with a painful punishment and will replace you with another people,"
            },
            {
                "clause": "and you will not harm Him at all."
            },
            {
                "clause": "And God is over all things competent."
            }
        ]
    },
    "1275": {
        "chapter": 9,
        "verse-number": 40,
        "verse-arabic": "إِلَّا تَنصُرُوهُ فَقَدْ نَصَرَهُ اللَّهُ إِذْ أَخْرَجَهُ الَّذِينَ كَفَرُوا ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا ۖ فَأَنزَلَ اللَّهُ سَكِينَتَهُ عَلَيْهِ وَأَيَّدَهُ بِجُنُودٍ لَّمْ تَرَوْهَا وَجَعَلَ كَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلَىٰ ۗ وَكَلِمَةُ اللَّهِ هِيَ الْعُلْيَا ۗ وَاللَّهُ عَزِيزٌ حَكِيمٌ",
        "verse-english": "If you do not aid the Prophet - Allah has already aided him when those who disbelieved had driven him out [of Makkah] as one of two, when they were in the cave and he said to his companion, \"Do not grieve; indeed Allah is with us.\" And Allah sent down his tranquillity upon him and supported him with angels you did not see and made the word of those who disbelieved the lowest, while the word of Allah - that is the highest. And Allah is Exalted in Might and Wise.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "If you do not aid the Prophet -"
            },
            {
                "clause": "God has already aided him when those who disbelieved had driven him out [of Makkah] as one of two,"
            },
            {
                "clause": "when they were in the cave and he said to his companion,"
            },
            {
                "clause": "\"Do not grieve;"
            },
            {
                "clause": "indeed God is with us."
            },
            {
                "clause": "\" And God sent down his tranquillity upon him and supported him with angels you did not see and made the word of those who disbelieved the lowest,"
            },
            {
                "clause": "while the word of God -"
            },
            {
                "clause": "that is the highest."
            },
            {
                "clause": "And God is Exalted in Might and Wise."
            }
        ]
    },
    "1276": {
        "chapter": 9,
        "verse-number": 41,
        "verse-arabic": "انفِرُوا خِفَافًا وَثِقَالًا وَجَاهِدُوا بِأَمْوَالِكُمْ وَأَنفُسِكُمْ فِي سَبِيلِ اللَّهِ ۚ ذَٰلِكُمْ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ",
        "verse-english": "Go forth, whether light or heavy, and strive with your wealth and your lives in the cause of Allah. That is better for you, if you only knew.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Go forth,"
            },
            {
                "clause": "whether light or heavy,"
            },
            {
                "clause": "and strive with your wealth and your lives in the cause of God."
            },
            {
                "clause": "That is better for you,"
            },
            {
                "clause": "if you only knew."
            }
        ]
    },
    "1277": {
        "chapter": 9,
        "verse-number": 42,
        "verse-arabic": "لَوْ كَانَ عَرَضًا قَرِيبًا وَسَفَرًا قَاصِدًا لَّاتَّبَعُوكَ وَلَٰكِن بَعُدَتْ عَلَيْهِمُ الشُّقَّةُ ۚ وَسَيَحْلِفُونَ بِاللَّهِ لَوِ اسْتَطَعْنَا لَخَرَجْنَا مَعَكُمْ يُهْلِكُونَ أَنفُسَهُمْ وَاللَّهُ يَعْلَمُ إِنَّهُمْ لَكَاذِبُونَ",
        "verse-english": "Had it been an easy gain and a moderate trip, the hypocrites would have followed you, but distant to them was the journey. And they will swear by Allah, \"If we were able, we would have gone forth with you,\" destroying themselves [through false oaths], and Allah knows that indeed they are liars.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Had it been an easy gain and a moderate trip,"
            },
            {
                "clause": "the hypocrites would have followed you,"
            },
            {
                "clause": "but distant to them was the journey."
            },
            {
                "clause": "And they will swear by God,"
            },
            {
                "clause": "\"If we were able,"
            },
            {
                "clause": "we would have gone forth with you,"
            },
            {
                "clause": "\" destroying themselves [through false oaths],"
            },
            {
                "clause": "and God knows that indeed they are liars."
            }
        ]
    },
    "1278": {
        "chapter": 9,
        "verse-number": 43,
        "verse-arabic": "عَفَا اللَّهُ عَنكَ لِمَ أَذِنتَ لَهُمْ حَتَّىٰ يَتَبَيَّنَ لَكَ الَّذِينَ صَدَقُوا وَتَعْلَمَ الْكَاذِبِينَ",
        "verse-english": "May Allah pardon you, [O Muhammad]; why did you give them permission [to remain behind]? [You should not have] until it was evident to you who were truthful and you knew [who were] the liars.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "May God pardon you,"
            },
            {
                "clause": "[O Muhammad];"
            },
            {
                "clause": "why did you give them permission [to remain behind]?"
            },
            {
                "clause": "[You should not have] until it was evident to you who were truthful and you knew [who were] the liars."
            }
        ]
    },
    "1279": {
        "chapter": 9,
        "verse-number": 44,
        "verse-arabic": "لَا يَسْتَأْذِنُكَ الَّذِينَ يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَن يُجَاهِدُوا بِأَمْوَالِهِمْ وَأَنفُسِهِمْ ۗ وَاللَّهُ عَلِيمٌ بِالْمُتَّقِينَ",
        "verse-english": "Those who believe in Allah and the Last Day would not ask permission of you to be excused from striving with their wealth and their lives. And Allah is Knowing of those who fear Him.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Those who believe in God and the Last Day would not ask permission of you to be excused from striving with their wealth and their lives."
            },
            {
                "clause": "And God is Knowing of those who fear Him."
            }
        ]
    },
    "1280": {
        "chapter": 9,
        "verse-number": 45,
        "verse-arabic": "إِنَّمَا يَسْتَأْذِنُكَ الَّذِينَ لَا يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَارْتَابَتْ قُلُوبُهُمْ فَهُمْ فِي رَيْبِهِمْ يَتَرَدَّدُونَ",
        "verse-english": "Only those would ask permission of you who do not believe in Allah and the Last Day and whose hearts have doubted, and they, in their doubt, are hesitating.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Only those would ask permission of you who do not believe in God and the Last Day and whose hearts have doubted,"
            },
            {
                "clause": "and they,"
            },
            {
                "clause": "in their doubt,"
            },
            {
                "clause": "are hesitating."
            }
        ]
    },
    "1281": {
        "chapter": 9,
        "verse-number": 46,
        "verse-arabic": "۞ وَلَوْ أَرَادُوا الْخُرُوجَ لَأَعَدُّوا لَهُ عُدَّةً وَلَٰكِن كَرِهَ اللَّهُ انبِعَاثَهُمْ فَثَبَّطَهُمْ وَقِيلَ اقْعُدُوا مَعَ الْقَاعِدِينَ",
        "verse-english": "And if they had intended to go forth, they would have prepared for it [some] preparation. But Allah disliked their being sent, so He kept them back, and they were told, \"Remain [behind] with those who remain.\"",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And if they had intended to go forth,"
            },
            {
                "clause": "they would have prepared for it [some] preparation."
            },
            {
                "clause": "But God disliked their being sent,"
            },
            {
                "clause": "so He kept them back,"
            },
            {
                "clause": "and they were told,"
            },
            {
                "clause": "\"Remain [behind] with those who remain."
            },
            {
                "clause": "\""
            }
        ]
    },
    "1282": {
        "chapter": 9,
        "verse-number": 47,
        "verse-arabic": "لَوْ خَرَجُوا فِيكُم مَّا زَادُوكُمْ إِلَّا خَبَالًا وَلَأَوْضَعُوا خِلَالَكُمْ يَبْغُونَكُمُ الْفِتْنَةَ وَفِيكُمْ سَمَّاعُونَ لَهُمْ ۗ وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ",
        "verse-english": "Had they gone forth with you, they would not have increased you except in confusion, and they would have been active among you, seeking [to cause] you fitnah. And among you are avid listeners to them. And Allah is Knowing of the wrongdoers.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Had they gone forth with you,"
            },
            {
                "clause": "they would not have increased you except in confusion,"
            },
            {
                "clause": "and they would have been active among you,"
            },
            {
                "clause": "seeking [to cause] you fitnah."
            },
            {
                "clause": "And among you are avid listeners to them."
            },
            {
                "clause": "And God is Knowing of the wrongdoers."
            }
        ]
    },
    "1283": {
        "chapter": 9,
        "verse-number": 48,
        "verse-arabic": "لَقَدِ ابْتَغَوُا الْفِتْنَةَ مِن قَبْلُ وَقَلَّبُوا لَكَ الْأُمُورَ حَتَّىٰ جَاءَ الْحَقُّ وَظَهَرَ أَمْرُ اللَّهِ وَهُمْ كَارِهُونَ",
        "verse-english": "They had already desired dissension before and had upset matters for you until the truth came and the ordinance of Allah appeared, while they were averse.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "They had already desired dissension before and had upset matters for you until the truth came and the ordinance of God appeared,"
            },
            {
                "clause": "while they were averse."
            }
        ]
    },
    "1284": {
        "chapter": 9,
        "verse-number": 49,
        "verse-arabic": "وَمِنْهُم مَّن يَقُولُ ائْذَن لِّي وَلَا تَفْتِنِّي ۚ أَلَا فِي الْفِتْنَةِ سَقَطُوا ۗ وَإِنَّ جَهَنَّمَ لَمُحِيطَةٌ بِالْكَافِرِينَ",
        "verse-english": "And among them is he who says, \"Permit me [to remain at home] and do not put me to trial.\" Unquestionably, into trial they have fallen. And indeed, Hell will encompass the disbelievers.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And among them is he who says,"
            },
            {
                "clause": "\"Permit me [to remain at home] and do not put me to trial."
            },
            {
                "clause": "\" Unquestionably,"
            },
            {
                "clause": "into trial they have fallen."
            },
            {
                "clause": "And indeed,"
            },
            {
                "clause": "Hell will encompass the disbelievers."
            }
        ]
    },
    "1285": {
        "chapter": 9,
        "verse-number": 50,
        "verse-arabic": "إِن تُصِبْكَ حَسَنَةٌ تَسُؤْهُمْ ۖ وَإِن تُصِبْكَ مُصِيبَةٌ يَقُولُوا قَدْ أَخَذْنَا أَمْرَنَا مِن قَبْلُ وَيَتَوَلَّوا وَّهُمْ فَرِحُونَ",
        "verse-english": "If good befalls you, it distresses them; but if disaster strikes you, they say, \"We took our matter [in hand] before,\" and turn away while they are rejoicing.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "If good befalls you,"
            },
            {
                "clause": "it distresses them;"
            },
            {
                "clause": "but if disaster strikes you,"
            },
            {
                "clause": "they say,"
            },
            {
                "clause": "\"We took our matter [in hand] before,"
            },
            {
                "clause": "\" and turn away while they are rejoicing."
            }
        ]
    },
    "1286": {
        "chapter": 9,
        "verse-number": 51,
        "verse-arabic": "قُل لَّن يُصِيبَنَا إِلَّا مَا كَتَبَ اللَّهُ لَنَا هُوَ مَوْلَانَا ۚ وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ",
        "verse-english": "Say, \"Never will we be struck except by what Allah has decreed for us; He is our protector.\" And upon Allah let the believers rely.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Say,"
            },
            {
                "clause": "\"Never will we be struck except by what God has decreed for us;"
            },
            {
                "clause": "He is our protector."
            },
            {
                "clause": "\" And upon God let the believers rely."
            }
        ]
    },
    "1287": {
        "chapter": 9,
        "verse-number": 52,
        "verse-arabic": "قُلْ هَلْ تَرَبَّصُونَ بِنَا إِلَّا إِحْدَى الْحُسْنَيَيْنِ ۖ وَنَحْنُ نَتَرَبَّصُ بِكُمْ أَن يُصِيبَكُمُ اللَّهُ بِعَذَابٍ مِّنْ عِندِهِ أَوْ بِأَيْدِينَا ۖ فَتَرَبَّصُوا إِنَّا مَعَكُم مُّتَرَبِّصُونَ",
        "verse-english": "Say, \"Do you await for us except one of the two best things while we await for you that Allah will afflict you with punishment from Himself or at our hands? So wait; indeed we, along with you, are waiting.\"",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Say,"
            },
            {
                "clause": "\"Do you await for us except one of the two best things while we await for you that God will afflict you with punishment from Himself or at our hands?"
            },
            {
                "clause": "So wait;"
            },
            {
                "clause": "indeed we,"
            },
            {
                "clause": "along with you,"
            },
            {
                "clause": "are waiting."
            },
            {
                "clause": "\""
            }
        ]
    },
    "1288": {
        "chapter": 9,
        "verse-number": 53,
        "verse-arabic": "قُلْ أَنفِقُوا طَوْعًا أَوْ كَرْهًا لَّن يُتَقَبَّلَ مِنكُمْ ۖ إِنَّكُمْ كُنتُمْ قَوْمًا فَاسِقِينَ",
        "verse-english": "Say, \"Spend willingly or unwillingly; never will it be accepted from you. Indeed, you have been a defiantly disobedient people.\"",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Say,"
            },
            {
                "clause": "\"Spend willingly or unwillingly;"
            },
            {
                "clause": "never will it be accepted from you."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "you have been a defiantly disobedient people."
            },
            {
                "clause": "\""
            }
        ]
    },
    "1289": {
        "chapter": 9,
        "verse-number": 54,
        "verse-arabic": "وَمَا مَنَعَهُمْ أَن تُقْبَلَ مِنْهُمْ نَفَقَاتُهُمْ إِلَّا أَنَّهُمْ كَفَرُوا بِاللَّهِ وَبِرَسُولِهِ وَلَا يَأْتُونَ الصَّلَاةَ إِلَّا وَهُمْ كُسَالَىٰ وَلَا يُنفِقُونَ إِلَّا وَهُمْ كَارِهُونَ",
        "verse-english": "And what prevents their expenditures from being accepted from them but that they have disbelieved in Allah and in His Messenger and that they come not to prayer except while they are lazy and that they do not spend except while they are unwilling.",
        "clauses-arabic": [
            {
                "clause": "وَمَا مَنَعَهُمْ أَن تُقْبَلَ مِنْهُمْ نَفَقَاتُهُمْ إِلَّا أَنَّهُمْ كَفَرُوا بِاللَّهِ وَبِرَسُولِهِ وَلَا يَأْتُونَ الصَّلَاةَ إِلَّا وَهُمْ كُسَالَىٰ وَلَا يُنفِقُونَ إِلَّا وَهُمْ كَارِهُونَ"
            }
        ],
        "clauses-english": [
            {
                "clause": "And what prevents their expenditures from being accepted from them but that they have disbelieved in God and in His Messenger and that they come not to prayer except while they are lazy and that they do not spend except while they are unwilling."
            }
        ]
    },
    "1290": {
        "chapter": 9,
        "verse-number": 55,
        "verse-arabic": "فَلَا تُعْجِبْكَ أَمْوَالُهُمْ وَلَا أَوْلَادُهُمْ ۚ إِنَّمَا يُرِيدُ اللَّهُ لِيُعَذِّبَهُم بِهَا فِي الْحَيَاةِ الدُّنْيَا وَتَزْهَقَ أَنفُسُهُمْ وَهُمْ كَافِرُونَ",
        "verse-english": "So let not their wealth or their children impress you. Allah only intends to punish them through them in worldly life and that their souls should depart [at death] while they are disbelievers.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "So let not their wealth or their children impress you."
            },
            {
                "clause": "God only intends to punish them through them in worldly life and that their souls should depart [at death] while they are disbelievers."
            }
        ]
    },
    "1291": {
        "chapter": 9,
        "verse-number": 56,
        "verse-arabic": "وَيَحْلِفُونَ بِاللَّهِ إِنَّهُمْ لَمِنكُمْ وَمَا هُم مِّنكُمْ وَلَٰكِنَّهُمْ قَوْمٌ يَفْرَقُونَ",
        "verse-english": "And they swear by Allah that they are from among you while they are not from among you; but they are a people who are afraid.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And they swear by God that they are from among you while they are not from among you;"
            },
            {
                "clause": "but they are a people who are afraid."
            }
        ]
    },
    "1292": {
        "chapter": 9,
        "verse-number": 57,
        "verse-arabic": "لَوْ يَجِدُونَ مَلْجَأً أَوْ مَغَارَاتٍ أَوْ مُدَّخَلًا لَّوَلَّوْا إِلَيْهِ وَهُمْ يَجْمَحُونَ",
        "verse-english": "If they could find a refuge or some caves or any place to enter [and hide], they would turn to it while they run heedlessly.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "If they could find a refuge or some caves or any place to enter [and hide],"
            },
            {
                "clause": "they would turn to it while they run heedlessly."
            }
        ]
    },
    "1293": {
        "chapter": 9,
        "verse-number": 58,
        "verse-arabic": "وَمِنْهُم مَّن يَلْمِزُكَ فِي الصَّدَقَاتِ فَإِنْ أُعْطُوا مِنْهَا رَضُوا وَإِن لَّمْ يُعْطَوْا مِنْهَا إِذَا هُمْ يَسْخَطُونَ",
        "verse-english": "And among them are some who criticize you concerning the [distribution of] charities. If they are given from them, they approve; but if they are not given from them, at once they become angry.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And among them are some who criticize you concerning the [distribution of] charities."
            },
            {
                "clause": "If they are given from them,"
            },
            {
                "clause": "they approve;"
            },
            {
                "clause": "but if they are not given from them,"
            },
            {
                "clause": "at once they become angry."
            }
        ]
    },
    "1294": {
        "chapter": 9,
        "verse-number": 59,
        "verse-arabic": "وَلَوْ أَنَّهُمْ رَضُوا مَا آتَاهُمُ اللَّهُ وَرَسُولُهُ وَقَالُوا حَسْبُنَا اللَّهُ سَيُؤْتِينَا اللَّهُ مِن فَضْلِهِ وَرَسُولُهُ إِنَّا إِلَى اللَّهِ رَاغِبُونَ",
        "verse-english": "If only they had been satisfied with what Allah and His Messenger gave them and said, \"Sufficient for us is Allah; Allah will give us of His bounty, and [so will] His Messenger; indeed, we are desirous toward Allah,\" [it would have been better for them].",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "If only they had been satisfied with what God and His Messenger gave them and said,"
            },
            {
                "clause": "\"Sufficient for us is God;"
            },
            {
                "clause": "God will give us of His bounty,"
            },
            {
                "clause": "and [so will] His Messenger;"
            },
            {
                "clause": "indeed,"
            },
            {
                "clause": "we are desirous toward God,"
            },
            {
                "clause": "\" [it would have been better for them]."
            }
        ]
    },
    "1295": {
        "chapter": 9,
        "verse-number": 60,
        "verse-arabic": "۞ إِنَّمَا الصَّدَقَاتُ لِلْفُقَرَاءِ وَالْمَسَاكِينِ وَالْعَامِلِينَ عَلَيْهَا وَالْمُؤَلَّفَةِ قُلُوبُهُمْ وَفِي الرِّقَابِ وَالْغَارِمِينَ وَفِي سَبِيلِ اللَّهِ وَابْنِ السَّبِيلِ ۖ فَرِيضَةً مِّنَ اللَّهِ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ",
        "verse-english": "Zakah expenditures are only for the poor and for the needy and for those employed to collect [zakah] and for bringing hearts together [for Islam] and for freeing captives [or slaves] and for those in debt and for the cause of Allah and for the [stranded] traveler - an obligation [imposed] by Allah. And Allah is Knowing and Wise.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Zakah expenditures are only for the poor and for the needy and for those employed to collect [zakah] and for bringing hearts together [for Islam] and for freeing captives [or slaves] and for those in debt and for the cause of God and for the [stranded] traveler -"
            },
            {
                "clause": "an obligation [imposed] by God."
            },
            {
                "clause": "And God is Knowing and Wise."
            }
        ]
    },
    "1296": {
        "chapter": 9,
        "verse-number": 61,
        "verse-arabic": "وَمِنْهُمُ الَّذِينَ يُؤْذُونَ النَّبِيَّ وَيَقُولُونَ هُوَ أُذُنٌ ۚ قُلْ أُذُنُ خَيْرٍ لَّكُمْ يُؤْمِنُ بِاللَّهِ وَيُؤْمِنُ لِلْمُؤْمِنِينَ وَرَحْمَةٌ لِّلَّذِينَ آمَنُوا مِنكُمْ ۚ وَالَّذِينَ يُؤْذُونَ رَسُولَ اللَّهِ لَهُمْ عَذَابٌ أَلِيمٌ",
        "verse-english": "And among them are those who abuse the Prophet and say, \"He is an ear.\" Say, \"[It is] an ear of goodness for you that believes in Allah and believes the believers and [is] a mercy to those who believe among you.\" And those who abuse the Messenger of Allah - for them is a painful punishment.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And among them are those who abuse the Prophet and say,"
            },
            {
                "clause": "\"He is an ear."
            },
            {
                "clause": "\" Say,"
            },
            {
                "clause": "\"[It is] an ear of goodness for you that believes in God and believes the believers and [is] a mercy to those who believe among you."
            },
            {
                "clause": "\" And those who abuse the Messenger of God -"
            },
            {
                "clause": "for them is a painful punishment."
            }
        ]
    },
    "1297": {
        "chapter": 9,
        "verse-number": 62,
        "verse-arabic": "يَحْلِفُونَ بِاللَّهِ لَكُمْ لِيُرْضُوكُمْ وَاللَّهُ وَرَسُولُهُ أَحَقُّ أَن يُرْضُوهُ إِن كَانُوا مُؤْمِنِينَ",
        "verse-english": "They swear by Allah to you [Muslims] to satisfy you. But Allah and His Messenger are more worthy for them to satisfy, if they should be believers.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "They swear by God to you [Muslims] to satisfy you."
            },
            {
                "clause": "But God and His Messenger are more worthy for them to satisfy,"
            },
            {
                "clause": "if they should be believers."
            }
        ]
    },
    "1298": {
        "chapter": 9,
        "verse-number": 63,
        "verse-arabic": "أَلَمْ يَعْلَمُوا أَنَّهُ مَن يُحَادِدِ اللَّهَ وَرَسُولَهُ فَأَنَّ لَهُ نَارَ جَهَنَّمَ خَالِدًا فِيهَا ۚ ذَٰلِكَ الْخِزْيُ الْعَظِيمُ",
        "verse-english": "Do they not know that whoever opposes Allah and His Messenger - that for him is the fire of Hell, wherein he will abide eternally? That is the great disgrace.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Do they not know that whoever opposes God and His Messenger -"
            },
            {
                "clause": "that for him is the fire of Hell,"
            },
            {
                "clause": "wherein he will abide eternally?"
            },
            {
                "clause": "That is the great disgrace."
            }
        ]
    },
    "1299": {
        "chapter": 9,
        "verse-number": 64,
        "verse-arabic": "يَحْذَرُ الْمُنَافِقُونَ أَن تُنَزَّلَ عَلَيْهِمْ سُورَةٌ تُنَبِّئُهُم بِمَا فِي قُلُوبِهِمْ ۚ قُلِ اسْتَهْزِئُوا إِنَّ اللَّهَ مُخْرِجٌ مَّا تَحْذَرُونَ",
        "verse-english": "They hypocrites are apprehensive lest a surah be revealed about them, informing them of what is in their hearts. Say, \"Mock [as you wish]; indeed, Allah will expose that which you fear.\"",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "They hypocrites are apprehensive lest a surah be revealed about them,"
            },
            {
                "clause": "informing them of what is in their hearts."
            },
            {
                "clause": "Say,"
            },
            {
                "clause": "\"Mock [as you wish];"
            },
            {
                "clause": "indeed,"
            },
            {
                "clause": "God will expose that which you fear."
            },
            {
                "clause": "\""
            }
        ]
    },
    "1300": {
        "chapter": 9,
        "verse-number": 65,
        "verse-arabic": "وَلَئِن سَأَلْتَهُمْ لَيَقُولُنَّ إِنَّمَا كُنَّا نَخُوضُ وَنَلْعَبُ ۚ قُلْ أَبِاللَّهِ وَآيَاتِهِ وَرَسُولِهِ كُنتُمْ تَسْتَهْزِئُونَ",
        "verse-english": "And if you ask them, they will surely say, \"We were only conversing and playing.\" Say, \"Is it Allah and His verses and His Messenger that you were mocking?\"",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And if you ask them,"
            },
            {
                "clause": "they will surely say,"
            },
            {
                "clause": "\"We were only conversing and playing."
            },
            {
                "clause": "\" Say,"
            },
            {
                "clause": "\"Is it God and His verses and His Messenger that you were mocking?"
            },
            {
                "clause": "\""
            }
        ]
    },
    "1301": {
        "chapter": 9,
        "verse-number": 66,
        "verse-arabic": "لَا تَعْتَذِرُوا قَدْ كَفَرْتُم بَعْدَ إِيمَانِكُمْ ۚ إِن نَّعْفُ عَن طَائِفَةٍ مِّنكُمْ نُعَذِّبْ طَائِفَةً بِأَنَّهُمْ كَانُوا مُجْرِمِينَ",
        "verse-english": "Make no excuse; you have disbelieved after your belief. If We pardon one faction of you - We will punish another faction because they were criminals.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Make no excuse;"
            },
            {
                "clause": "you have disbelieved after your belief."
            },
            {
                "clause": "If We pardon one faction of you -"
            },
            {
                "clause": "We will punish another faction because they were criminals."
            }
        ]
    },
    "1302": {
        "chapter": 9,
        "verse-number": 67,
        "verse-arabic": "الْمُنَافِقُونَ وَالْمُنَافِقَاتُ بَعْضُهُم مِّن بَعْضٍ ۚ يَأْمُرُونَ بِالْمُنكَرِ وَيَنْهَوْنَ عَنِ الْمَعْرُوفِ وَيَقْبِضُونَ أَيْدِيَهُمْ ۚ نَسُوا اللَّهَ فَنَسِيَهُمْ ۗ إِنَّ الْمُنَافِقِينَ هُمُ الْفَاسِقُونَ",
        "verse-english": "The hypocrite men and hypocrite women are of one another. They enjoin what is wrong and forbid what is right and close their hands. They have forgotten Allah, so He has forgotten them [accordingly]. Indeed, the hypocrites - it is they who are the defiantly disobedient.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "The hypocrite men and hypocrite women are of one another."
            },
            {
                "clause": "They enjoin what is wrong and forbid what is right and close their hands."
            },
            {
                "clause": "They have forgotten God,"
            },
            {
                "clause": "so He has forgotten them [accordingly]."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "the hypocrites -"
            },
            {
                "clause": "it is they who are the defiantly disobedient."
            }
        ]
    },
    "1303": {
        "chapter": 9,
        "verse-number": 68,
        "verse-arabic": "وَعَدَ اللَّهُ الْمُنَافِقِينَ وَالْمُنَافِقَاتِ وَالْكُفَّارَ نَارَ جَهَنَّمَ خَالِدِينَ فِيهَا ۚ هِيَ حَسْبُهُمْ ۚ وَلَعَنَهُمُ اللَّهُ ۖ وَلَهُمْ عَذَابٌ مُّقِيمٌ",
        "verse-english": "Allah has promised the hypocrite men and hypocrite women and the disbelievers the fire of Hell, wherein they will abide eternally. It is sufficient for them. And Allah has cursed them, and for them is an enduring punishment.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "God has promised the hypocrite men and hypocrite women and the disbelievers the fire of Hell,"
            },
            {
                "clause": "wherein they will abide eternally."
            },
            {
                "clause": "It is sufficient for them."
            },
            {
                "clause": "And God has cursed them,"
            },
            {
                "clause": "and for them is an enduring punishment."
            }
        ]
    },
    "1304": {
        "chapter": 9,
        "verse-number": 69,
        "verse-arabic": "كَالَّذِينَ مِن قَبْلِكُمْ كَانُوا أَشَدَّ مِنكُمْ قُوَّةً وَأَكْثَرَ أَمْوَالًا وَأَوْلَادًا فَاسْتَمْتَعُوا بِخَلَاقِهِمْ فَاسْتَمْتَعْتُم بِخَلَاقِكُمْ كَمَا اسْتَمْتَعَ الَّذِينَ مِن قَبْلِكُم بِخَلَاقِهِمْ وَخُضْتُمْ كَالَّذِي خَاضُوا ۚ أُولَٰئِكَ حَبِطَتْ أَعْمَالُهُمْ فِي الدُّنْيَا وَالْآخِرَةِ ۖ وَأُولَٰئِكَ هُمُ الْخَاسِرُونَ",
        "verse-english": "[You disbelievers are] like those before you; they were stronger than you in power and more abundant in wealth and children. They enjoyed their portion [of worldly enjoyment], and you have enjoyed your portion as those before you enjoyed their portion, and you have engaged [in vanities] like that in which they engaged. [It is] those whose deeds have become worthless in this world and in the Hereafter, and it is they who are the losers.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "[You disbelievers are] like those before you;"
            },
            {
                "clause": "they were stronger than you in power and more abundant in wealth and children."
            },
            {
                "clause": "They enjoyed their portion [of worldly enjoyment],"
            },
            {
                "clause": "and you have enjoyed your portion as those before you enjoyed their portion,"
            },
            {
                "clause": "and you have engaged [in vanities] like that in which they engaged."
            },
            {
                "clause": "[It is] those whose deeds have become worthless in this world and in the Hereafter,"
            },
            {
                "clause": "and it is they who are the losers."
            }
        ]
    },
    "1305": {
        "chapter": 9,
        "verse-number": 70,
        "verse-arabic": "أَلَمْ يَأْتِهِمْ نَبَأُ الَّذِينَ مِن قَبْلِهِمْ قَوْمِ نُوحٍ وَعَادٍ وَثَمُودَ وَقَوْمِ إِبْرَاهِيمَ وَأَصْحَابِ مَدْيَنَ وَالْمُؤْتَفِكَاتِ ۚ أَتَتْهُمْ رُسُلُهُم بِالْبَيِّنَاتِ ۖ فَمَا كَانَ اللَّهُ لِيَظْلِمَهُمْ وَلَٰكِن كَانُوا أَنفُسَهُمْ يَظْلِمُونَ",
        "verse-english": "Has there not reached them the news of those before them - the people of Noah and [the tribes of] 'Aad and Thamud and the people of Abraham and the companions of Madyan and the towns overturned? Their messengers came to them with clear proofs. And Allah would never have wronged them, but they were wronging themselves.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Has there not reached them the news of those before them -"
            },
            {
                "clause": "the people of Noah and [the tribes of] 'Aad and Thamud and the people of Abraham and the companions of Madyan and the towns overturned?"
            },
            {
                "clause": "Their messengers came to them with clear proofs."
            },
            {
                "clause": "And God would never have wronged them,"
            },
            {
                "clause": "but they were wronging themselves."
            }
        ]
    },
    "1306": {
        "chapter": 9,
        "verse-number": 71,
        "verse-arabic": "وَالْمُؤْمِنُونَ وَالْمُؤْمِنَاتُ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۚ يَأْمُرُونَ بِالْمَعْرُوفِ وَيَنْهَوْنَ عَنِ الْمُنكَرِ وَيُقِيمُونَ الصَّلَاةَ وَيُؤْتُونَ الزَّكَاةَ وَيُطِيعُونَ اللَّهَ وَرَسُولَهُ ۚ أُولَٰئِكَ سَيَرْحَمُهُمُ اللَّهُ ۗ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ",
        "verse-english": "The believing men and believing women are allies of one another. They enjoin what is right and forbid what is wrong and establish prayer and give zakah and obey Allah and His Messenger. Those - Allah will have mercy upon them. Indeed, Allah is Exalted in Might and Wise.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "The believing men and believing women are allies of one another."
            },
            {
                "clause": "They enjoin what is right and forbid what is wrong and establish prayer and give zakah and obey God and His Messenger."
            },
            {
                "clause": "Those -"
            },
            {
                "clause": "God will have mercy upon them."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "God is Exalted in Might and Wise."
            }
        ]
    },
    "1307": {
        "chapter": 9,
        "verse-number": 72,
        "verse-arabic": "وَعَدَ اللَّهُ الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا وَمَسَاكِنَ طَيِّبَةً فِي جَنَّاتِ عَدْنٍ ۚ وَرِضْوَانٌ مِّنَ اللَّهِ أَكْبَرُ ۚ ذَٰلِكَ هُوَ الْفَوْزُ الْعَظِيمُ",
        "verse-english": "Allah has promised the believing men and believing women gardens beneath which rivers flow, wherein they abide eternally, and pleasant dwellings in gardens of perpetual residence; but approval from Allah is greater. It is that which is the great attainment.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "God has promised the believing men and believing women gardens beneath which rivers flow,"
            },
            {
                "clause": "wherein they abide eternally,"
            },
            {
                "clause": "and pleasant dwellings in gardens of perpetual residence;"
            },
            {
                "clause": "but approval from God is greater."
            },
            {
                "clause": "It is that which is the great attainment."
            }
        ]
    },
    "1308": {
        "chapter": 9,
        "verse-number": 73,
        "verse-arabic": "يَا أَيُّهَا النَّبِيُّ جَاهِدِ الْكُفَّارَ وَالْمُنَافِقِينَ وَاغْلُظْ عَلَيْهِمْ ۚ وَمَأْوَاهُمْ جَهَنَّمُ ۖ وَبِئْسَ الْمَصِيرُ",
        "verse-english": "O Prophet, fight against the disbelievers and the hypocrites and be harsh upon them. And their refuge is Hell, and wretched is the destination.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "O Prophet,"
            },
            {
                "clause": "fight against the disbelievers and the hypocrites and be harsh upon them."
            },
            {
                "clause": "And their refuge is Hell,"
            },
            {
                "clause": "and wretched is the destination."
            }
        ]
    },
    "1309": {
        "chapter": 9,
        "verse-number": 74,
        "verse-arabic": "يَحْلِفُونَ بِاللَّهِ مَا قَالُوا وَلَقَدْ قَالُوا كَلِمَةَ الْكُفْرِ وَكَفَرُوا بَعْدَ إِسْلَامِهِمْ وَهَمُّوا بِمَا لَمْ يَنَالُوا ۚ وَمَا نَقَمُوا إِلَّا أَنْ أَغْنَاهُمُ اللَّهُ وَرَسُولُهُ مِن فَضْلِهِ ۚ فَإِن يَتُوبُوا يَكُ خَيْرًا لَّهُمْ ۖ وَإِن يَتَوَلَّوْا يُعَذِّبْهُمُ اللَّهُ عَذَابًا أَلِيمًا فِي الدُّنْيَا وَالْآخِرَةِ ۚ وَمَا لَهُمْ فِي الْأَرْضِ مِن وَلِيٍّ وَلَا نَصِيرٍ",
        "verse-english": "They swear by Allah that they did not say [anything against the Prophet] while they had said the word of disbelief and disbelieved after their [pretense of] Islam and planned that which they were not to attain. And they were not resentful except [for the fact] that Allah and His Messenger had enriched them of His bounty. So if they repent, it is better for them; but if they turn away, Allah will punish them with a painful punishment in this world and the Hereafter. And there will not be for them on earth any protector or helper.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "They swear by God that they did not say [anything against the Prophet] while they had said the word of disbelief and disbelieved after their [pretense of] Islam and planned that which they were not to attain."
            },
            {
                "clause": "And they were not resentful except [for the fact] that God and His Messenger had enriched them of His bounty."
            },
            {
                "clause": "So if they repent,"
            },
            {
                "clause": "it is better for them;"
            },
            {
                "clause": "but if they turn away,"
            },
            {
                "clause": "God will punish them with a painful punishment in this world and the Hereafter."
            },
            {
                "clause": "And there will not be for them on earth any protector or helper."
            }
        ]
    },
    "1310": {
        "chapter": 9,
        "verse-number": 75,
        "verse-arabic": "۞ وَمِنْهُم مَّنْ عَاهَدَ اللَّهَ لَئِنْ آتَانَا مِن فَضْلِهِ لَنَصَّدَّقَنَّ وَلَنَكُونَنَّ مِنَ الصَّالِحِينَ",
        "verse-english": "And among them are those who made a covenant with Allah, [saying], \"If He should give us from His bounty, we will surely spend in charity, and we will surely be among the righteous.\"",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And among them are those who made a covenant with God,"
            },
            {
                "clause": "[saying],"
            },
            {
                "clause": "\"If He should give us from His bounty,"
            },
            {
                "clause": "we will surely spend in charity,"
            },
            {
                "clause": "and we will surely be among the righteous."
            },
            {
                "clause": "\""
            }
        ]
    },
    "1311": {
        "chapter": 9,
        "verse-number": 76,
        "verse-arabic": "فَلَمَّا آتَاهُم مِّن فَضْلِهِ بَخِلُوا بِهِ وَتَوَلَّوا وَّهُم مُّعْرِضُونَ",
        "verse-english": "But when he gave them from His bounty, they were stingy with it and turned away while they refused.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "But when he gave them from His bounty,"
            },
            {
                "clause": "they were stingy with it and turned away while they refused."
            }
        ]
    },
    "1312": {
        "chapter": 9,
        "verse-number": 77,
        "verse-arabic": "فَأَعْقَبَهُمْ نِفَاقًا فِي قُلُوبِهِمْ إِلَىٰ يَوْمِ يَلْقَوْنَهُ بِمَا أَخْلَفُوا اللَّهَ مَا وَعَدُوهُ وَبِمَا كَانُوا يَكْذِبُونَ",
        "verse-english": "So He penalized them with hypocrisy in their hearts until the Day they will meet Him - because they failed Allah in what they promised Him and because they [habitually] used to lie.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "So He penalized them with hypocrisy in their hearts until the Day they will meet Him -"
            },
            {
                "clause": "because they failed God in what they promised Him and because they [habitually] used to lie."
            }
        ]
    },
    "1313": {
        "chapter": 9,
        "verse-number": 78,
        "verse-arabic": "أَلَمْ يَعْلَمُوا أَنَّ اللَّهَ يَعْلَمُ سِرَّهُمْ وَنَجْوَاهُمْ وَأَنَّ اللَّهَ عَلَّامُ الْغُيُوبِ",
        "verse-english": "Did they not know that Allah knows their secrets and their private conversations and that Allah is the Knower of the unseen?",
        "clauses-arabic": [
            {
                "clause": "أَلَمْ يَعْلَمُوا أَنَّ اللَّهَ يَعْلَمُ سِرَّهُمْ وَنَجْوَاهُمْ وَأَنَّ اللَّهَ عَلَّامُ الْغُيُوبِ"
            }
        ],
        "clauses-english": [
            {
                "clause": "Did they not know that God knows their secrets and their private conversations and that God is the Knower of the unseen?"
            }
        ]
    },
    "1314": {
        "chapter": 9,
        "verse-number": 79,
        "verse-arabic": "الَّذِينَ يَلْمِزُونَ الْمُطَّوِّعِينَ مِنَ الْمُؤْمِنِينَ فِي الصَّدَقَاتِ وَالَّذِينَ لَا يَجِدُونَ إِلَّا جُهْدَهُمْ فَيَسْخَرُونَ مِنْهُمْ ۙ سَخِرَ اللَّهُ مِنْهُمْ وَلَهُمْ عَذَابٌ أَلِيمٌ",
        "verse-english": "Those who criticize the contributors among the believers concerning [their] charities and [criticize] the ones who find nothing [to spend] except their effort, so they ridicule them - Allah will ridicule them, and they will have a painful punishment.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Those who criticize the contributors among the believers concerning [their] charities and [criticize] the ones who find nothing [to spend] except their effort,"
            },
            {
                "clause": "so they ridicule them -"
            },
            {
                "clause": "God will ridicule them,"
            },
            {
                "clause": "and they will have a painful punishment."
            }
        ]
    },
    "1315": {
        "chapter": 9,
        "verse-number": 80,
        "verse-arabic": "اسْتَغْفِرْ لَهُمْ أَوْ لَا تَسْتَغْفِرْ لَهُمْ إِن تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَن يَغْفِرَ اللَّهُ لَهُمْ ۚ ذَٰلِكَ بِأَنَّهُمْ كَفَرُوا بِاللَّهِ وَرَسُولِهِ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الْفَاسِقِينَ",
        "verse-english": "Ask forgiveness for them, [O Muhammad], or do not ask forgiveness for them. If you should ask forgiveness for them seventy times - never will Allah forgive them. That is because they disbelieved in Allah and His Messenger, and Allah does not guide the defiantly disobedient people.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Ask forgiveness for them,"
            },
            {
                "clause": "[O Muhammad],"
            },
            {
                "clause": "or do not ask forgiveness for them."
            },
            {
                "clause": "If you should ask forgiveness for them seventy times -"
            },
            {
                "clause": "never will God forgive them."
            },
            {
                "clause": "That is because they disbelieved in God and His Messenger,"
            },
            {
                "clause": "and God does not guide the defiantly disobedient people."
            }
        ]
    },
    "1316": {
        "chapter": 9,
        "verse-number": 81,
        "verse-arabic": "فَرِحَ الْمُخَلَّفُونَ بِمَقْعَدِهِمْ خِلَافَ رَسُولِ اللَّهِ وَكَرِهُوا أَن يُجَاهِدُوا بِأَمْوَالِهِمْ وَأَنفُسِهِمْ فِي سَبِيلِ اللَّهِ وَقَالُوا لَا تَنفِرُوا فِي الْحَرِّ ۗ قُلْ نَارُ جَهَنَّمَ أَشَدُّ حَرًّا ۚ لَّوْ كَانُوا يَفْقَهُونَ",
        "verse-english": "Those who remained behind rejoiced in their staying [at home] after [the departure of] the Messenger of Allah and disliked to strive with their wealth and their lives in the cause of Allah and said, \"Do not go forth in the heat.\" Say, \"The fire of Hell is more intensive in heat\" - if they would but understand.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Those who remained behind rejoiced in their staying [at home] after [the departure of] the Messenger of God and disliked to strive with their wealth and their lives in the cause of God and said,"
            },
            {
                "clause": "\"Do not go forth in the heat."
            },
            {
                "clause": "\" Say,"
            },
            {
                "clause": "\"The fire of Hell is more intensive in heat\" -"
            },
            {
                "clause": "if they would but understand."
            }
        ]
    },
    "1317": {
        "chapter": 9,
        "verse-number": 82,
        "verse-arabic": "فَلْيَضْحَكُوا قَلِيلًا وَلْيَبْكُوا كَثِيرًا جَزَاءً بِمَا كَانُوا يَكْسِبُونَ",
        "verse-english": "So let them laugh a little and [then] weep much as recompense for what they used to earn.",
        "clauses-arabic": [
            {
                "clause": "فَلْيَضْحَكُوا قَلِيلًا وَلْيَبْكُوا كَثِيرًا جَزَاءً بِمَا كَانُوا يَكْسِبُونَ"
            }
        ],
        "clauses-english": [
            {
                "clause": "So let them laugh a little and [then] weep much as recompense for what they used to earn."
            }
        ]
    },
    "1318": {
        "chapter": 9,
        "verse-number": 83,
        "verse-arabic": "فَإِن رَّجَعَكَ اللَّهُ إِلَىٰ طَائِفَةٍ مِّنْهُمْ فَاسْتَأْذَنُوكَ لِلْخُرُوجِ فَقُل لَّن تَخْرُجُوا مَعِيَ أَبَدًا وَلَن تُقَاتِلُوا مَعِيَ عَدُوًّا ۖ إِنَّكُمْ رَضِيتُم بِالْقُعُودِ أَوَّلَ مَرَّةٍ فَاقْعُدُوا مَعَ الْخَالِفِينَ",
        "verse-english": "If Allah should return you to a faction of them [after the expedition] and then they ask your permission to go out [to battle], say, \"You will not go out with me, ever, and you will never fight with me an enemy. Indeed, you were satisfied with sitting [at home] the first time, so sit [now] with those who stay behind.\"",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "If God should return you to a faction of them [after the expedition] and then they ask your permission to go out [to battle],"
            },
            {
                "clause": "say,"
            },
            {
                "clause": "\"You will not go out with me,"
            },
            {
                "clause": "ever,"
            },
            {
                "clause": "and you will never fight with me an enemy."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "you were satisfied with sitting [at home] the first time,"
            },
            {
                "clause": "so sit [now] with those who stay behind."
            },
            {
                "clause": "\""
            }
        ]
    },
    "1319": {
        "chapter": 9,
        "verse-number": 84,
        "verse-arabic": "وَلَا تُصَلِّ عَلَىٰ أَحَدٍ مِّنْهُم مَّاتَ أَبَدًا وَلَا تَقُمْ عَلَىٰ قَبْرِهِ ۖ إِنَّهُمْ كَفَرُوا بِاللَّهِ وَرَسُولِهِ وَمَاتُوا وَهُمْ فَاسِقُونَ",
        "verse-english": "And do not pray [the funeral prayer, O Muhammad], over any of them who has died - ever - or stand at his grave. Indeed, they disbelieved in Allah and His Messenger and died while they were defiantly disobedient.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And do not pray [the funeral prayer,"
            },
            {
                "clause": "O Muhammad],"
            },
            {
                "clause": "over any of them who has died -"
            },
            {
                "clause": "ever -"
            },
            {
                "clause": "or stand at his grave."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "they disbelieved in God and His Messenger and died while they were defiantly disobedient."
            }
        ]
    },
    "1320": {
        "chapter": 9,
        "verse-number": 85,
        "verse-arabic": "وَلَا تُعْجِبْكَ أَمْوَالُهُمْ وَأَوْلَادُهُمْ ۚ إِنَّمَا يُرِيدُ اللَّهُ أَن يُعَذِّبَهُم بِهَا فِي الدُّنْيَا وَتَزْهَقَ أَنفُسُهُمْ وَهُمْ كَافِرُونَ",
        "verse-english": "And let not their wealth and their children impress you. Allah only intends to punish them through them in this world and that their souls should depart [at death] while they are disbelievers.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And let not their wealth and their children impress you."
            },
            {
                "clause": "God only intends to punish them through them in this world and that their souls should depart [at death] while they are disbelievers."
            }
        ]
    },
    "1321": {
        "chapter": 9,
        "verse-number": 86,
        "verse-arabic": "وَإِذَا أُنزِلَتْ سُورَةٌ أَنْ آمِنُوا بِاللَّهِ وَجَاهِدُوا مَعَ رَسُولِهِ اسْتَأْذَنَكَ أُولُو الطَّوْلِ مِنْهُمْ وَقَالُوا ذَرْنَا نَكُن مَّعَ الْقَاعِدِينَ",
        "verse-english": "And when a surah was revealed [enjoining them] to believe in Allah and to fight with His Messenger, those of wealth among them asked your permission [to stay back] and said, \"Leave us to be with them who sit [at home].\"",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And when a surah was revealed [enjoining them] to believe in God and to fight with His Messenger,"
            },
            {
                "clause": "those of wealth among them asked your permission [to stay back] and said,"
            },
            {
                "clause": "\"Leave us to be with them who sit [at home]."
            },
            {
                "clause": "\""
            }
        ]
    },
    "1322": {
        "chapter": 9,
        "verse-number": 87,
        "verse-arabic": "رَضُوا بِأَن يَكُونُوا مَعَ الْخَوَالِفِ وَطُبِعَ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَفْقَهُونَ",
        "verse-english": "They were satisfied to be with those who stay behind, and their hearts were sealed over, so they do not understand.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "They were satisfied to be with those who stay behind,"
            },
            {
                "clause": "and their hearts were sealed over,"
            },
            {
                "clause": "so they do not understand."
            }
        ]
    },
    "1323": {
        "chapter": 9,
        "verse-number": 88,
        "verse-arabic": "لَٰكِنِ الرَّسُولُ وَالَّذِينَ آمَنُوا مَعَهُ جَاهَدُوا بِأَمْوَالِهِمْ وَأَنفُسِهِمْ ۚ وَأُولَٰئِكَ لَهُمُ الْخَيْرَاتُ ۖ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ",
        "verse-english": "But the Messenger and those who believed with him fought with their wealth and their lives. Those will have [all that is] good, and it is those who are the successful.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "But the Messenger and those who believed with him fought with their wealth and their lives."
            },
            {
                "clause": "Those will have [all that is] good,"
            },
            {
                "clause": "and it is those who are the successful."
            }
        ]
    },
    "1324": {
        "chapter": 9,
        "verse-number": 89,
        "verse-arabic": "أَعَدَّ اللَّهُ لَهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ",
        "verse-english": "Allah has prepared for them gardens beneath which rivers flow, wherein they will abide eternally. That is the great attainment.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "God has prepared for them gardens beneath which rivers flow,"
            },
            {
                "clause": "wherein they will abide eternally."
            },
            {
                "clause": "That is the great attainment."
            }
        ]
    },
    "1325": {
        "chapter": 9,
        "verse-number": 90,
        "verse-arabic": "وَجَاءَ الْمُعَذِّرُونَ مِنَ الْأَعْرَابِ لِيُؤْذَنَ لَهُمْ وَقَعَدَ الَّذِينَ كَذَبُوا اللَّهَ وَرَسُولَهُ ۚ سَيُصِيبُ الَّذِينَ كَفَرُوا مِنْهُمْ عَذَابٌ أَلِيمٌ",
        "verse-english": "And those with excuses among the bedouins came to be permitted [to remain], and they who had lied to Allah and His Messenger sat [at home]. There will strike those who disbelieved among them a painful punishment.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And those with excuses among the bedouins came to be permitted [to remain],"
            },
            {
                "clause": "and they who had lied to God and His Messenger sat [at home]."
            },
            {
                "clause": "There will strike those who disbelieved among them a painful punishment."
            }
        ]
    },
    "1326": {
        "chapter": 9,
        "verse-number": 91,
        "verse-arabic": "لَّيْسَ عَلَى الضُّعَفَاءِ وَلَا عَلَى الْمَرْضَىٰ وَلَا عَلَى الَّذِينَ لَا يَجِدُونَ مَا يُنفِقُونَ حَرَجٌ إِذَا نَصَحُوا لِلَّهِ وَرَسُولِهِ ۚ مَا عَلَى الْمُحْسِنِينَ مِن سَبِيلٍ ۚ وَاللَّهُ غَفُورٌ رَّحِيمٌ",
        "verse-english": "There is not upon the weak or upon the ill or upon those who do not find anything to spend any discomfort when they are sincere to Allah and His Messenger. There is not upon the doers of good any cause [for blame]. And Allah is Forgiving and Merciful.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "There is not upon the weak or upon the ill or upon those who do not find anything to spend any discomfort when they are sincere to God and His Messenger."
            },
            {
                "clause": "There is not upon the doers of good any cause [for blame]."
            },
            {
                "clause": "And God is Forgiving and Merciful."
            }
        ]
    },
    "1327": {
        "chapter": 9,
        "verse-number": 92,
        "verse-arabic": "وَلَا عَلَى الَّذِينَ إِذَا مَا أَتَوْكَ لِتَحْمِلَهُمْ قُلْتَ لَا أَجِدُ مَا أَحْمِلُكُمْ عَلَيْهِ تَوَلَّوا وَّأَعْيُنُهُمْ تَفِيضُ مِنَ الدَّمْعِ حَزَنًا أَلَّا يَجِدُوا مَا يُنفِقُونَ",
        "verse-english": "Nor [is there blame] upon those who, when they came to you that you might give them mounts, you said, \"I can find nothing for you to ride upon.\" They turned back while their eyes overflowed with tears out of grief that they could not find something to spend [for the cause of Allah].",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Nor [is there blame] upon those who,"
            },
            {
                "clause": "when they came to you that you might give them mounts,"
            },
            {
                "clause": "you said,"
            },
            {
                "clause": "\"I can find nothing for you to ride upon."
            },
            {
                "clause": "\" They turned back while their eyes overflowed with tears out of grief that they could not find something to spend [for the cause of God]."
            }
        ]
    },
    "1328": {
        "chapter": 9,
        "verse-number": 93,
        "verse-arabic": "۞ إِنَّمَا السَّبِيلُ عَلَى الَّذِينَ يَسْتَأْذِنُونَكَ وَهُمْ أَغْنِيَاءُ ۚ رَضُوا بِأَن يَكُونُوا مَعَ الْخَوَالِفِ وَطَبَعَ اللَّهُ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَعْلَمُونَ",
        "verse-english": "The cause [for blame] is only upon those who ask permission of you while they are rich. They are satisfied to be with those who stay behind, and Allah has sealed over their hearts, so they do not know.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "The cause [for blame] is only upon those who ask permission of you while they are rich."
            },
            {
                "clause": "They are satisfied to be with those who stay behind,"
            },
            {
                "clause": "and God has sealed over their hearts,"
            },
            {
                "clause": "so they do not know."
            }
        ]
    },
    "1329": {
        "chapter": 9,
        "verse-number": 94,
        "verse-arabic": "يَعْتَذِرُونَ إِلَيْكُمْ إِذَا رَجَعْتُمْ إِلَيْهِمْ ۚ قُل لَّا تَعْتَذِرُوا لَن نُّؤْمِنَ لَكُمْ قَدْ نَبَّأَنَا اللَّهُ مِنْ أَخْبَارِكُمْ ۚ وَسَيَرَى اللَّهُ عَمَلَكُمْ وَرَسُولُهُ ثُمَّ تُرَدُّونَ إِلَىٰ عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ",
        "verse-english": "They will make excuses to you when you have returned to them. Say, \"Make no excuse - never will we believe you. Allah has already informed us of your news. And Allah will observe your deeds, and [so will] His Messenger; then you will be taken back to the Knower of the unseen and the witnessed, and He will inform you of what you used to do.\"",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "They will make excuses to you when you have returned to them."
            },
            {
                "clause": "Say,"
            },
            {
                "clause": "\"Make no excuse -"
            },
            {
                "clause": "never will we believe you."
            },
            {
                "clause": "God has already informed us of your news."
            },
            {
                "clause": "And God will observe your deeds,"
            },
            {
                "clause": "and [so will] His Messenger;"
            },
            {
                "clause": "then you will be taken back to the Knower of the unseen and the witnessed,"
            },
            {
                "clause": "and He will inform you of what you used to do."
            },
            {
                "clause": "\""
            }
        ]
    },
    "1330": {
        "chapter": 9,
        "verse-number": 95,
        "verse-arabic": "سَيَحْلِفُونَ بِاللَّهِ لَكُمْ إِذَا انقَلَبْتُمْ إِلَيْهِمْ لِتُعْرِضُوا عَنْهُمْ ۖ فَأَعْرِضُوا عَنْهُمْ ۖ إِنَّهُمْ رِجْسٌ ۖ وَمَأْوَاهُمْ جَهَنَّمُ جَزَاءً بِمَا كَانُوا يَكْسِبُونَ",
        "verse-english": "They will swear by Allah to you when you return to them that you would leave them alone. So leave them alone; indeed they are evil; and their refuge is Hell as recompense for what they had been earning.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "They will swear by God to you when you return to them that you would leave them alone."
            },
            {
                "clause": "So leave them alone;"
            },
            {
                "clause": "indeed they are evil;"
            },
            {
                "clause": "and their refuge is Hell as recompense for what they had been earning."
            }
        ]
    },
    "1331": {
        "chapter": 9,
        "verse-number": 96,
        "verse-arabic": "يَحْلِفُونَ لَكُمْ لِتَرْضَوْا عَنْهُمْ ۖ فَإِن تَرْضَوْا عَنْهُمْ فَإِنَّ اللَّهَ لَا يَرْضَىٰ عَنِ الْقَوْمِ الْفَاسِقِينَ",
        "verse-english": "They swear to you so that you might be satisfied with them. But if you should be satisfied with them - indeed, Allah is not satisfied with a defiantly disobedient people.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "They swear to you so that you might be satisfied with them."
            },
            {
                "clause": "But if you should be satisfied with them -"
            },
            {
                "clause": "indeed,"
            },
            {
                "clause": "God is not satisfied with a defiantly disobedient people."
            }
        ]
    },
    "1332": {
        "chapter": 9,
        "verse-number": 97,
        "verse-arabic": "الْأَعْرَابُ أَشَدُّ كُفْرًا وَنِفَاقًا وَأَجْدَرُ أَلَّا يَعْلَمُوا حُدُودَ مَا أَنزَلَ اللَّهُ عَلَىٰ رَسُولِهِ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ",
        "verse-english": "The bedouins are stronger in disbelief and hypocrisy and more likely not to know the limits of what [laws] Allah has revealed to His Messenger. And Allah is Knowing and Wise.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "The bedouins are stronger in disbelief and hypocrisy and more likely not to know the limits of what [laws] God has revealed to His Messenger."
            },
            {
                "clause": "And God is Knowing and Wise."
            }
        ]
    },
    "1333": {
        "chapter": 9,
        "verse-number": 98,
        "verse-arabic": "وَمِنَ الْأَعْرَابِ مَن يَتَّخِذُ مَا يُنفِقُ مَغْرَمًا وَيَتَرَبَّصُ بِكُمُ الدَّوَائِرَ ۚ عَلَيْهِمْ دَائِرَةُ السَّوْءِ ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ",
        "verse-english": "And among the bedouins are some who consider what they spend as a loss and await for you turns of misfortune. Upon them will be a misfortune of evil. And Allah is Hearing and Knowing.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And among the bedouins are some who consider what they spend as a loss and await for you turns of misfortune."
            },
            {
                "clause": "Upon them will be a misfortune of evil."
            },
            {
                "clause": "And God is Hearing and Knowing."
            }
        ]
    },
    "1334": {
        "chapter": 9,
        "verse-number": 99,
        "verse-arabic": "وَمِنَ الْأَعْرَابِ مَن يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَيَتَّخِذُ مَا يُنفِقُ قُرُبَاتٍ عِندَ اللَّهِ وَصَلَوَاتِ الرَّسُولِ ۚ أَلَا إِنَّهَا قُرْبَةٌ لَّهُمْ ۚ سَيُدْخِلُهُمُ اللَّهُ فِي رَحْمَتِهِ ۗ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ",
        "verse-english": "But among the bedouins are some who believe in Allah and the Last Day and consider what they spend as means of nearness to Allah and of [obtaining] invocations of the Messenger. Unquestionably, it is a means of nearness for them. Allah will admit them to His mercy. Indeed, Allah is Forgiving and Merciful.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "But among the bedouins are some who believe in God and the Last Day and consider what they spend as means of nearness to God and of [obtaining] invocations of the Messenger."
            },
            {
                "clause": "Unquestionably,"
            },
            {
                "clause": "it is a means of nearness for them."
            },
            {
                "clause": "God will admit them to His mercy."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "God is Forgiving and Merciful."
            }
        ]
    },
    "1335": {
        "chapter": 9,
        "verse-number": 100,
        "verse-arabic": "وَالسَّابِقُونَ الْأَوَّلُونَ مِنَ الْمُهَاجِرِينَ وَالْأَنصَارِ وَالَّذِينَ اتَّبَعُوهُم بِإِحْسَانٍ رَّضِيَ اللَّهُ عَنْهُمْ وَرَضُوا عَنْهُ وَأَعَدَّ لَهُمْ جَنَّاتٍ تَجْرِي تَحْتَهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ۚ ذَٰلِكَ الْفَوْزُ الْعَظِيمُ",
        "verse-english": "And the first forerunners [in the faith] among the Muhajireen and the Ansar and those who followed them with good conduct - Allah is pleased with them and they are pleased with Him, and He has prepared for them gardens beneath which rivers flow, wherein they will abide forever. That is the great attainment.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And the first forerunners [in the faith] among the Muhajireen and the Ansar and those who followed them with good conduct -"
            },
            {
                "clause": "God is pleased with them and they are pleased with Him,"
            },
            {
                "clause": "and He has prepared for them gardens beneath which rivers flow,"
            },
            {
                "clause": "wherein they will abide forever."
            },
            {
                "clause": "That is the great attainment."
            }
        ]
    },
    "1336": {
        "chapter": 9,
        "verse-number": 101,
        "verse-arabic": "وَمِمَّنْ حَوْلَكُم مِّنَ الْأَعْرَابِ مُنَافِقُونَ ۖ وَمِنْ أَهْلِ الْمَدِينَةِ ۖ مَرَدُوا عَلَى النِّفَاقِ لَا تَعْلَمُهُمْ ۖ نَحْنُ نَعْلَمُهُمْ ۚ سَنُعَذِّبُهُم مَّرَّتَيْنِ ثُمَّ يُرَدُّونَ إِلَىٰ عَذَابٍ عَظِيمٍ",
        "verse-english": "And among those around you of the bedouins are hypocrites, and [also] from the people of Madinah. They have become accustomed to hypocrisy. You, [O Muhammad], do not know them, [but] We know them. We will punish them twice [in this world]; then they will be returned to a great punishment.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And among those around you of the bedouins are hypocrites,"
            },
            {
                "clause": "and [also] from the people of Madinah."
            },
            {
                "clause": "They have become accustomed to hypocrisy."
            },
            {
                "clause": "You,"
            },
            {
                "clause": "[O Muhammad],"
            },
            {
                "clause": "do not know them,"
            },
            {
                "clause": "[but] We know them."
            },
            {
                "clause": "We will punish them twice [in this world];"
            },
            {
                "clause": "then they will be returned to a great punishment."
            }
        ]
    },
    "1337": {
        "chapter": 9,
        "verse-number": 102,
        "verse-arabic": "وَآخَرُونَ اعْتَرَفُوا بِذُنُوبِهِمْ خَلَطُوا عَمَلًا صَالِحًا وَآخَرَ سَيِّئًا عَسَى اللَّهُ أَن يَتُوبَ عَلَيْهِمْ ۚ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ",
        "verse-english": "And [there are] others who have acknowledged their sins. They had mixed a righteous deed with another that was bad. Perhaps Allah will turn to them in forgiveness. Indeed, Allah is Forgiving and Merciful.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And [there are] others who have acknowledged their sins."
            },
            {
                "clause": "They had mixed a righteous deed with another that was bad."
            },
            {
                "clause": "Perhaps God will turn to them in forgiveness."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "God is Forgiving and Merciful."
            }
        ]
    },
    "1338": {
        "chapter": 9,
        "verse-number": 103,
        "verse-arabic": "خُذْ مِنْ أَمْوَالِهِمْ صَدَقَةً تُطَهِّرُهُمْ وَتُزَكِّيهِم بِهَا وَصَلِّ عَلَيْهِمْ ۖ إِنَّ صَلَاتَكَ سَكَنٌ لَّهُمْ ۗ وَاللَّهُ سَمِيعٌ عَلِيمٌ",
        "verse-english": "Take, [O, Muhammad], from their wealth a charity by which you purify them and cause them increase, and invoke [Allah 's blessings] upon them. Indeed, your invocations are reassurance for them. And Allah is Hearing and Knowing.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Take,"
            },
            {
                "clause": "[O,"
            },
            {
                "clause": "Muhammad],"
            },
            {
                "clause": "from their wealth a charity by which you purify them and cause them increase,"
            },
            {
                "clause": "and invoke [God 's blessings] upon them."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "your invocations are reassurance for them."
            },
            {
                "clause": "And God is Hearing and Knowing."
            }
        ]
    },
    "1339": {
        "chapter": 9,
        "verse-number": 104,
        "verse-arabic": "أَلَمْ يَعْلَمُوا أَنَّ اللَّهَ هُوَ يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ وَيَأْخُذُ الصَّدَقَاتِ وَأَنَّ اللَّهَ هُوَ التَّوَّابُ الرَّحِيمُ",
        "verse-english": "Do they not know that it is Allah who accepts repentance from His servants and receives charities and that it is Allah who is the Accepting of repentance, the Merciful?",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Do they not know that it is God who accepts repentance from His servants and receives charities and that it is God who is the Accepting of repentance,"
            },
            {
                "clause": "the Merciful?"
            }
        ]
    },
    "1340": {
        "chapter": 9,
        "verse-number": 105,
        "verse-arabic": "وَقُلِ اعْمَلُوا فَسَيَرَى اللَّهُ عَمَلَكُمْ وَرَسُولُهُ وَالْمُؤْمِنُونَ ۖ وَسَتُرَدُّونَ إِلَىٰ عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ",
        "verse-english": "And say, \"Do [as you will], for Allah will see your deeds, and [so, will] His Messenger and the believers. And you will be returned to the Knower of the unseen and the witnessed, and He will inform you of what you used to do.\"",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And say,"
            },
            {
                "clause": "\"Do [as you will],"
            },
            {
                "clause": "for God will see your deeds,"
            },
            {
                "clause": "and [so,"
            },
            {
                "clause": "will] His Messenger and the believers."
            },
            {
                "clause": "And you will be returned to the Knower of the unseen and the witnessed,"
            },
            {
                "clause": "and He will inform you of what you used to do."
            },
            {
                "clause": "\""
            }
        ]
    },
    "1341": {
        "chapter": 9,
        "verse-number": 106,
        "verse-arabic": "وَآخَرُونَ مُرْجَوْنَ لِأَمْرِ اللَّهِ إِمَّا يُعَذِّبُهُمْ وَإِمَّا يَتُوبُ عَلَيْهِمْ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ",
        "verse-english": "And [there are] others deferred until the command of Allah - whether He will punish them or whether He will forgive them. And Allah is Knowing and Wise.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And [there are] others deferred until the command of God -"
            },
            {
                "clause": "whether He will punish them or whether He will forgive them."
            },
            {
                "clause": "And God is Knowing and Wise."
            }
        ]
    },
    "1342": {
        "chapter": 9,
        "verse-number": 107,
        "verse-arabic": "وَالَّذِينَ اتَّخَذُوا مَسْجِدًا ضِرَارًا وَكُفْرًا وَتَفْرِيقًا بَيْنَ الْمُؤْمِنِينَ وَإِرْصَادًا لِّمَنْ حَارَبَ اللَّهَ وَرَسُولَهُ مِن قَبْلُ ۚ وَلَيَحْلِفُنَّ إِنْ أَرَدْنَا إِلَّا الْحُسْنَىٰ ۖ وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ",
        "verse-english": "And [there are] those [hypocrites] who took for themselves a mosque for causing harm and disbelief and division among the believers and as a station for whoever had warred against Allah and His Messenger before. And they will surely swear, \"We intended only the best.\" And Allah testifies that indeed they are liars.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And [there are] those [hypocrites] who took for themselves a mosque for causing harm and disbelief and division among the believers and as a station for whoever had warred against God and His Messenger before."
            },
            {
                "clause": "And they will surely swear,"
            },
            {
                "clause": "\"We intended only the best."
            },
            {
                "clause": "\" And God testifies that indeed they are liars."
            }
        ]
    },
    "1343": {
        "chapter": 9,
        "verse-number": 108,
        "verse-arabic": "لَا تَقُمْ فِيهِ أَبَدًا ۚ لَّمَسْجِدٌ أُسِّسَ عَلَى التَّقْوَىٰ مِنْ أَوَّلِ يَوْمٍ أَحَقُّ أَن تَقُومَ فِيهِ ۚ فِيهِ رِجَالٌ يُحِبُّونَ أَن يَتَطَهَّرُوا ۚ وَاللَّهُ يُحِبُّ الْمُطَّهِّرِينَ",
        "verse-english": "Do not stand [for prayer] within it - ever. A mosque founded on righteousness from the first day is more worthy for you to stand in. Within it are men who love to purify themselves; and Allah loves those who purify themselves.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Do not stand [for prayer] within it -"
            },
            {
                "clause": "ever."
            },
            {
                "clause": "A mosque founded on righteousness from the first day is more worthy for you to stand in."
            },
            {
                "clause": "Within it are men who love to purify themselves;"
            },
            {
                "clause": "and God loves those who purify themselves."
            }
        ]
    },
    "1344": {
        "chapter": 9,
        "verse-number": 109,
        "verse-arabic": "أَفَمَنْ أَسَّسَ بُنْيَانَهُ عَلَىٰ تَقْوَىٰ مِنَ اللَّهِ وَرِضْوَانٍ خَيْرٌ أَم مَّنْ أَسَّسَ بُنْيَانَهُ عَلَىٰ شَفَا جُرُفٍ هَارٍ فَانْهَارَ بِهِ فِي نَارِ جَهَنَّمَ ۗ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ",
        "verse-english": "Then is one who laid the foundation of his building on righteousness [with fear] from Allah and [seeking] His approval better or one who laid the foundation of his building on the edge of a bank about to collapse, so it collapsed with him into the fire of Hell? And Allah does not guide the wrongdoing people.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Then is one who laid the foundation of his building on righteousness [with fear] from God and [seeking] His approval better or one who laid the foundation of his building on the edge of a bank about to collapse,"
            },
            {
                "clause": "so it collapsed with him into the fire of Hell?"
            },
            {
                "clause": "And God does not guide the wrongdoing people."
            }
        ]
    },
    "1345": {
        "chapter": 9,
        "verse-number": 110,
        "verse-arabic": "لَا يَزَالُ بُنْيَانُهُمُ الَّذِي بَنَوْا رِيبَةً فِي قُلُوبِهِمْ إِلَّا أَن تَقَطَّعَ قُلُوبُهُمْ ۗ وَاللَّهُ عَلِيمٌ حَكِيمٌ",
        "verse-english": "Their building which they built will not cease to be a [cause of] skepticism in their hearts until their hearts are stopped. And Allah is Knowing and Wise.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Their building which they built will not cease to be a [cause of] skepticism in their hearts until their hearts are stopped."
            },
            {
                "clause": "And God is Knowing and Wise."
            }
        ]
    },
    "1346": {
        "chapter": 9,
        "verse-number": 111,
        "verse-arabic": "۞ إِنَّ اللَّهَ اشْتَرَىٰ مِنَ الْمُؤْمِنِينَ أَنفُسَهُمْ وَأَمْوَالَهُم بِأَنَّ لَهُمُ الْجَنَّةَ ۚ يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ فَيَقْتُلُونَ وَيُقْتَلُونَ ۖ وَعْدًا عَلَيْهِ حَقًّا فِي التَّوْرَاةِ وَالْإِنجِيلِ وَالْقُرْآنِ ۚ وَمَنْ أَوْفَىٰ بِعَهْدِهِ مِنَ اللَّهِ ۚ فَاسْتَبْشِرُوا بِبَيْعِكُمُ الَّذِي بَايَعْتُم بِهِ ۚ وَذَٰلِكَ هُوَ الْفَوْزُ الْعَظِيمُ",
        "verse-english": "Indeed, Allah has purchased from the believers their lives and their properties [in exchange] for that they will have Paradise. They fight in the cause of Allah, so they kill and are killed. [It is] a true promise [binding] upon Him in the Torah and the Gospel and the Qur'an. And who is truer to his covenant than Allah? So rejoice in your transaction which you have contracted. And it is that which is the great attainment.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Indeed,"
            },
            {
                "clause": "God has purchased from the believers their lives and their properties [in exchange] for that they will have Paradise."
            },
            {
                "clause": "They fight in the cause of God,"
            },
            {
                "clause": "so they kill and are killed."
            },
            {
                "clause": "[It is] a true promise [binding] upon Him in the Torah and the Gospel and the Qur'an."
            },
            {
                "clause": "And who is truer to his covenant than God?"
            },
            {
                "clause": "So rejoice in your transaction which you have contracted."
            },
            {
                "clause": "And it is that which is the great attainment."
            }
        ]
    },
    "1347": {
        "chapter": 9,
        "verse-number": 112,
        "verse-arabic": "التَّائِبُونَ الْعَابِدُونَ الْحَامِدُونَ السَّائِحُونَ الرَّاكِعُونَ السَّاجِدُونَ الْآمِرُونَ بِالْمَعْرُوفِ وَالنَّاهُونَ عَنِ الْمُنكَرِ وَالْحَافِظُونَ لِحُدُودِ اللَّهِ ۗ وَبَشِّرِ الْمُؤْمِنِينَ",
        "verse-english": "[Such believers are] the repentant, the worshippers, the praisers [of Allah], the travelers [for His cause], those who bow and prostrate [in prayer], those who enjoin what is right and forbid what is wrong, and those who observe the limits [set by] Allah. And give good tidings to the believers.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "[Such believers are] the repentant,"
            },
            {
                "clause": "the worshippers,"
            },
            {
                "clause": "the praisers [of God],"
            },
            {
                "clause": "the travelers [for His cause],"
            },
            {
                "clause": "those who bow and prostrate [in prayer],"
            },
            {
                "clause": "those who enjoin what is right and forbid what is wrong,"
            },
            {
                "clause": "and those who observe the limits [set by] God."
            },
            {
                "clause": "And give good tidings to the believers."
            }
        ]
    },
    "1348": {
        "chapter": 9,
        "verse-number": 113,
        "verse-arabic": "مَا كَانَ لِلنَّبِيِّ وَالَّذِينَ آمَنُوا أَن يَسْتَغْفِرُوا لِلْمُشْرِكِينَ وَلَوْ كَانُوا أُولِي قُرْبَىٰ مِن بَعْدِ مَا تَبَيَّنَ لَهُمْ أَنَّهُمْ أَصْحَابُ الْجَحِيمِ",
        "verse-english": "It is not for the Prophet and those who have believed to ask forgiveness for the polytheists, even if they were relatives, after it has become clear to them that they are companions of Hellfire.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "It is not for the Prophet and those who have believed to ask forgiveness for the polytheists,"
            },
            {
                "clause": "even if they were relatives,"
            },
            {
                "clause": "after it has become clear to them that they are companions of Hellfire."
            }
        ]
    },
    "1349": {
        "chapter": 9,
        "verse-number": 114,
        "verse-arabic": "وَمَا كَانَ اسْتِغْفَارُ إِبْرَاهِيمَ لِأَبِيهِ إِلَّا عَن مَّوْعِدَةٍ وَعَدَهَا إِيَّاهُ فَلَمَّا تَبَيَّنَ لَهُ أَنَّهُ عَدُوٌّ لِّلَّهِ تَبَرَّأَ مِنْهُ ۚ إِنَّ إِبْرَاهِيمَ لَأَوَّاهٌ حَلِيمٌ",
        "verse-english": "And the request of forgiveness of Abraham for his father was only because of a promise he had made to him. But when it became apparent to Abraham that his father was an enemy to Allah, he disassociated himself from him. Indeed was Abraham compassionate and patient.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And the request of forgiveness of Abraham for his father was only because of a promise he had made to him."
            },
            {
                "clause": "But when it became apparent to Abraham that his father was an enemy to God,"
            },
            {
                "clause": "he disassociated himself from him."
            },
            {
                "clause": "Indeed was Abraham compassionate and patient."
            }
        ]
    },
    "1350": {
        "chapter": 9,
        "verse-number": 115,
        "verse-arabic": "وَمَا كَانَ اللَّهُ لِيُضِلَّ قَوْمًا بَعْدَ إِذْ هَدَاهُمْ حَتَّىٰ يُبَيِّنَ لَهُم مَّا يَتَّقُونَ ۚ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ",
        "verse-english": "And Allah would not let a people stray after He has guided them until He makes clear to them what they should avoid. Indeed, Allah is Knowing of all things.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And God would not let a people stray after He has guided them until He makes clear to them what they should avoid."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "God is Knowing of all things."
            }
        ]
    },
    "1351": {
        "chapter": 9,
        "verse-number": 116,
        "verse-arabic": "إِنَّ اللَّهَ لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۖ يُحْيِي وَيُمِيتُ ۚ وَمَا لَكُم مِّن دُونِ اللَّهِ مِن وَلِيٍّ وَلَا نَصِيرٍ",
        "verse-english": "Indeed, to Allah belongs the dominion of the heavens and the earth; He gives life and causes death. And you have not besides Allah any protector or any helper.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Indeed,"
            },
            {
                "clause": "to God belongs the dominion of the heavens and the earth;"
            },
            {
                "clause": "He gives life and causes death."
            },
            {
                "clause": "And you have not besides God any protector or any helper."
            }
        ]
    },
    "1352": {
        "chapter": 9,
        "verse-number": 117,
        "verse-arabic": "لَّقَد تَّابَ اللَّهُ عَلَى النَّبِيِّ وَالْمُهَاجِرِينَ وَالْأَنصَارِ الَّذِينَ اتَّبَعُوهُ فِي سَاعَةِ الْعُسْرَةِ مِن بَعْدِ مَا كَادَ يَزِيغُ قُلُوبُ فَرِيقٍ مِّنْهُمْ ثُمَّ تَابَ عَلَيْهِمْ ۚ إِنَّهُ بِهِمْ رَءُوفٌ رَّحِيمٌ",
        "verse-english": "Allah has already forgiven the Prophet and the Muhajireen and the Ansar who followed him in the hour of difficulty after the hearts of a party of them had almost inclined [to doubt], and then He forgave them. Indeed, He was to them Kind and Merciful.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "God has already forgiven the Prophet and the Muhajireen and the Ansar who followed him in the hour of difficulty after the hearts of a party of them had almost inclined [to doubt],"
            },
            {
                "clause": "and then He forgave them."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "He was to them Kind and Merciful."
            }
        ]
    },
    "1353": {
        "chapter": 9,
        "verse-number": 118,
        "verse-arabic": "وَعَلَى الثَّلَاثَةِ الَّذِينَ خُلِّفُوا حَتَّىٰ إِذَا ضَاقَتْ عَلَيْهِمُ الْأَرْضُ بِمَا رَحُبَتْ وَضَاقَتْ عَلَيْهِمْ أَنفُسُهُمْ وَظَنُّوا أَن لَّا مَلْجَأَ مِنَ اللَّهِ إِلَّا إِلَيْهِ ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا ۚ إِنَّ اللَّهَ هُوَ التَّوَّابُ الرَّحِيمُ",
        "verse-english": "And [He also forgave] the three who were left behind [and regretted their error] to the point that the earth closed in on them in spite of its vastness and their souls confined them and they were certain that there is no refuge from Allah except in Him. Then He turned to them so they could repent. Indeed, Allah is the Accepting of repentance, the Merciful.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And [He also forgave] the three who were left behind [and regretted their error] to the point that the earth closed in on them in spite of its vastness and their souls confined them and they were certain that there is no refuge from God except in Him."
            },
            {
                "clause": "Then He turned to them so they could repent."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "God is the Accepting of repentance,"
            },
            {
                "clause": "the Merciful."
            }
        ]
    },
    "1354": {
        "chapter": 9,
        "verse-number": 119,
        "verse-arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَكُونُوا مَعَ الصَّادِقِينَ",
        "verse-english": "O you who have believed, fear Allah and be with those who are true.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "O you who have believed,"
            },
            {
                "clause": "fear God and be with those who are true."
            }
        ]
    },
    "1355": {
        "chapter": 9,
        "verse-number": 120,
        "verse-arabic": "مَا كَانَ لِأَهْلِ الْمَدِينَةِ وَمَنْ حَوْلَهُم مِّنَ الْأَعْرَابِ أَن يَتَخَلَّفُوا عَن رَّسُولِ اللَّهِ وَلَا يَرْغَبُوا بِأَنفُسِهِمْ عَن نَّفْسِهِ ۚ ذَٰلِكَ بِأَنَّهُمْ لَا يُصِيبُهُمْ ظَمَأٌ وَلَا نَصَبٌ وَلَا مَخْمَصَةٌ فِي سَبِيلِ اللَّهِ وَلَا يَطَئُونَ مَوْطِئًا يَغِيظُ الْكُفَّارَ وَلَا يَنَالُونَ مِنْ عَدُوٍّ نَّيْلًا إِلَّا كُتِبَ لَهُم بِهِ عَمَلٌ صَالِحٌ ۚ إِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُحْسِنِينَ",
        "verse-english": "It was not [proper] for the people of Madinah and those surrounding them of the bedouins that they remain behind after [the departure of] the Messenger of Allah or that they prefer themselves over his self. That is because they are not afflicted by thirst or fatigue or hunger in the cause of Allah, nor do they tread on any ground that enrages the disbelievers, nor do they inflict upon an enemy any infliction but that is registered for them as a righteous deed. Indeed, Allah does not allow to be lost the reward of the doers of good.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "It was not [proper] for the people of Madinah and those surrounding them of the bedouins that they remain behind after [the departure of] the Messenger of God or that they prefer themselves over his self."
            },
            {
                "clause": "That is because they are not afflicted by thirst or fatigue or hunger in the cause of God,"
            },
            {
                "clause": "nor do they tread on any ground that enrages the disbelievers,"
            },
            {
                "clause": "nor do they inflict upon an enemy any infliction but that is registered for them as a righteous deed."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "God does not allow to be lost the reward of the doers of good."
            }
        ]
    },
    "1356": {
        "chapter": 9,
        "verse-number": 121,
        "verse-arabic": "وَلَا يُنفِقُونَ نَفَقَةً صَغِيرَةً وَلَا كَبِيرَةً وَلَا يَقْطَعُونَ وَادِيًا إِلَّا كُتِبَ لَهُمْ لِيَجْزِيَهُمُ اللَّهُ أَحْسَنَ مَا كَانُوا يَعْمَلُونَ",
        "verse-english": "Nor do they spend an expenditure, small or large, or cross a valley but that it is registered for them that Allah may reward them for the best of what they were doing.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Nor do they spend an expenditure,"
            },
            {
                "clause": "small or large,"
            },
            {
                "clause": "or cross a valley but that it is registered for them that God may reward them for the best of what they were doing."
            }
        ]
    },
    "1357": {
        "chapter": 9,
        "verse-number": 122,
        "verse-arabic": "۞ وَمَا كَانَ الْمُؤْمِنُونَ لِيَنفِرُوا كَافَّةً ۚ فَلَوْلَا نَفَرَ مِن كُلِّ فِرْقَةٍ مِّنْهُمْ طَائِفَةٌ لِّيَتَفَقَّهُوا فِي الدِّينِ وَلِيُنذِرُوا قَوْمَهُمْ إِذَا رَجَعُوا إِلَيْهِمْ لَعَلَّهُمْ يَحْذَرُونَ",
        "verse-english": "And it is not for the believers to go forth [to battle] all at once. For there should separate from every division of them a group [remaining] to obtain understanding in the religion and warn their people when they return to them that they might be cautious.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And it is not for the believers to go forth [to battle] all at once."
            },
            {
                "clause": "For there should separate from every division of them a group [remaining] to obtain understanding in the religion and warn their people when they return to them that they might be cautious."
            }
        ]
    },
    "1358": {
        "chapter": 9,
        "verse-number": 123,
        "verse-arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا قَاتِلُوا الَّذِينَ يَلُونَكُم مِّنَ الْكُفَّارِ وَلْيَجِدُوا فِيكُمْ غِلْظَةً ۚ وَاعْلَمُوا أَنَّ اللَّهَ مَعَ الْمُتَّقِينَ",
        "verse-english": "O you who have believed, fight those adjacent to you of the disbelievers and let them find in you harshness. And know that Allah is with the righteous.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "O you who have believed,"
            },
            {
                "clause": "fight those adjacent to you of the disbelievers and let them find in you harshness."
            },
            {
                "clause": "And know that God is with the righteous."
            }
        ]
    },
    "1359": {
        "chapter": 9,
        "verse-number": 124,
        "verse-arabic": "وَإِذَا مَا أُنزِلَتْ سُورَةٌ فَمِنْهُم مَّن يَقُولُ أَيُّكُمْ زَادَتْهُ هَٰذِهِ إِيمَانًا ۚ فَأَمَّا الَّذِينَ آمَنُوا فَزَادَتْهُمْ إِيمَانًا وَهُمْ يَسْتَبْشِرُونَ",
        "verse-english": "And whenever a surah is revealed, there are among the hypocrites those who say, \"Which of you has this increased faith?\" As for those who believed, it has increased them in faith, while they are rejoicing.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And whenever a surah is revealed,"
            },
            {
                "clause": "there are among the hypocrites those who say,"
            },
            {
                "clause": "\"Which of you has this increased faith?"
            },
            {
                "clause": "\" As for those who believed,"
            },
            {
                "clause": "it has increased them in faith,"
            },
            {
                "clause": "while they are rejoicing."
            }
        ]
    },
    "1360": {
        "chapter": 9,
        "verse-number": 125,
        "verse-arabic": "وَأَمَّا الَّذِينَ فِي قُلُوبِهِم مَّرَضٌ فَزَادَتْهُمْ رِجْسًا إِلَىٰ رِجْسِهِمْ وَمَاتُوا وَهُمْ كَافِرُونَ",
        "verse-english": "But as for those in whose hearts is disease, it has [only] increased them in evil [in addition] to their evil. And they will have died while they are disbelievers.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "But as for those in whose hearts is disease,"
            },
            {
                "clause": "it has [only] increased them in evil [in addition] to their evil."
            },
            {
                "clause": "And they will have died while they are disbelievers."
            }
        ]
    },
    "1361": {
        "chapter": 9,
        "verse-number": 126,
        "verse-arabic": "أَوَلَا يَرَوْنَ أَنَّهُمْ يُفْتَنُونَ فِي كُلِّ عَامٍ مَّرَّةً أَوْ مَرَّتَيْنِ ثُمَّ لَا يَتُوبُونَ وَلَا هُمْ يَذَّكَّرُونَ",
        "verse-english": "Do they not see that they are tried every year once or twice but then they do not repent nor do they remember?",
        "clauses-arabic": [
            {
                "clause": "أَوَلَا يَرَوْنَ أَنَّهُمْ يُفْتَنُونَ فِي كُلِّ عَامٍ مَّرَّةً أَوْ مَرَّتَيْنِ ثُمَّ لَا يَتُوبُونَ وَلَا هُمْ يَذَّكَّرُونَ"
            }
        ],
        "clauses-english": [
            {
                "clause": "Do they not see that they are tried every year once or twice but then they do not repent nor do they remember?"
            }
        ]
    },
    "1362": {
        "chapter": 9,
        "verse-number": 127,
        "verse-arabic": "وَإِذَا مَا أُنزِلَتْ سُورَةٌ نَّظَرَ بَعْضُهُمْ إِلَىٰ بَعْضٍ هَلْ يَرَاكُم مِّنْ أَحَدٍ ثُمَّ انصَرَفُوا ۚ صَرَفَ اللَّهُ قُلُوبَهُم بِأَنَّهُمْ قَوْمٌ لَّا يَفْقَهُونَ",
        "verse-english": "And whenever a surah is revealed, they look at each other, [saying], \"Does anyone see you?\" and then they dismiss themselves. Allah has dismissed their hearts because they are a people who do not understand.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And whenever a surah is revealed,"
            },
            {
                "clause": "they look at each other,"
            },
            {
                "clause": "[saying],"
            },
            {
                "clause": "\"Does anyone see you?"
            },
            {
                "clause": "\" and then they dismiss themselves."
            },
            {
                "clause": "God has dismissed their hearts because they are a people who do not understand."
            }
        ]
    },
    "1363": {
        "chapter": 9,
        "verse-number": 128,
        "verse-arabic": "لَقَدْ جَاءَكُمْ رَسُولٌ مِّنْ أَنفُسِكُمْ عَزِيزٌ عَلَيْهِ مَا عَنِتُّمْ حَرِيصٌ عَلَيْكُم بِالْمُؤْمِنِينَ رَءُوفٌ رَّحِيمٌ",
        "verse-english": "There has certainly come to you a Messenger from among yourselves. Grievous to him is what you suffer; [he is] concerned over you and to the believers is kind and merciful.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "There has certainly come to you a Messenger from among yourselves."
            },
            {
                "clause": "Grievous to him is what you suffer;"
            },
            {
                "clause": "[he is] concerned over you and to the believers is kind and merciful."
            }
        ]
    },
    "1364": {
        "chapter": 9,
        "verse-number": 129,
        "verse-arabic": "فَإِن تَوَلَّوْا فَقُلْ حَسْبِيَ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۖ عَلَيْهِ تَوَكَّلْتُ ۖ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
        "verse-english": "But if they turn away, [O Muhammad], say, \"Sufficient for me is Allah; there is no deity except Him. On Him I have relied, and He is the Lord of the Great Throne.\"",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "But if they turn away,"
            },
            {
                "clause": "[O Muhammad],"
            },
            {
                "clause": "say,"
            },
            {
                "clause": "\"Sufficient for me is God;"
            },
            {
                "clause": "there is no deity except Him."
            },
            {
                "clause": "On Him I have relied,"
            },
            {
                "clause": "and He is the Lord of the Great Throne."
            },
            {
                "clause": "\""
            }
        ]
    }
}