{
    "5076": {
        "chapter": 57,
        "verse-number": 1,
        "verse-arabic": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
        "verse-english": "Whatever is in the heavens and earth exalts Allah, and He is the Exalted in Might, the Wise.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Whatever is in the heavens and earth exalts God,"
            },
            {
                "clause": "and He is the Exalted in Might,"
            },
            {
                "clause": "the Wise."
            }
        ]
    },
    "5077": {
        "chapter": 57,
        "verse-number": 2,
        "verse-arabic": "لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۖ يُحْيِي وَيُمِيتُ ۖ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
        "verse-english": "His is the dominion of the heavens and earth. He gives life and causes death, and He is over all things competent.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "His is the dominion of the heavens and earth."
            },
            {
                "clause": "He gives life and causes death,"
            },
            {
                "clause": "and He is over all things competent."
            }
        ]
    },
    "5078": {
        "chapter": 57,
        "verse-number": 3,
        "verse-arabic": "هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ ۖ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ",
        "verse-english": "He is the First and the Last, the Ascendant and the Intimate, and He is, of all things, Knowing.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "He is the First and the Last,"
            },
            {
                "clause": "the Ascendant and the Intimate,"
            },
            {
                "clause": "and He is,"
            },
            {
                "clause": "of all things,"
            },
            {
                "clause": "Knowing."
            }
        ]
    },
    "5079": {
        "chapter": 57,
        "verse-number": 4,
        "verse-arabic": "هُوَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۚ يَعْلَمُ مَا يَلِجُ فِي الْأَرْضِ وَمَا يَخْرُجُ مِنْهَا وَمَا يَنزِلُ مِنَ السَّمَاءِ وَمَا يَعْرُجُ فِيهَا ۖ وَهُوَ مَعَكُمْ أَيْنَ مَا كُنتُمْ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
        "verse-english": "It is He who created the heavens and earth in six days and then established Himself above the Throne. He knows what penetrates into the earth and what emerges from it and what descends from the heaven and what ascends therein; and He is with you wherever you are. And Allah, of what you do, is Seeing.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "It is He who created the heavens and earth in six days and then established Himself above the Throne."
            },
            {
                "clause": "He knows what penetrates into the earth and what emerges from it and what descends from the heaven and what ascends therein;"
            },
            {
                "clause": "and He is with you wherever you are."
            },
            {
                "clause": "And God,"
            },
            {
                "clause": "of what you do,"
            },
            {
                "clause": "is Seeing."
            }
        ]
    },
    "5080": {
        "chapter": 57,
        "verse-number": 5,
        "verse-arabic": "لَّهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۚ وَإِلَى اللَّهِ تُرْجَعُ الْأُمُورُ",
        "verse-english": "His is the dominion of the heavens and earth. And to Allah are returned [all] matters.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "His is the dominion of the heavens and earth."
            },
            {
                "clause": "And to God are returned [all] matters."
            }
        ]
    },
    "5081": {
        "chapter": 57,
        "verse-number": 6,
        "verse-arabic": "يُولِجُ اللَّيْلَ فِي النَّهَارِ وَيُولِجُ النَّهَارَ فِي اللَّيْلِ ۚ وَهُوَ عَلِيمٌ بِذَاتِ الصُّدُورِ",
        "verse-english": "He causes the night to enter the day and causes the day to enter the night, and he is Knowing of that within the breasts.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "He causes the night to enter the day and causes the day to enter the night,"
            },
            {
                "clause": "and he is Knowing of that within the breasts."
            }
        ]
    },
    "5082": {
        "chapter": 57,
        "verse-number": 7,
        "verse-arabic": "آمِنُوا بِاللَّهِ وَرَسُولِهِ وَأَنفِقُوا مِمَّا جَعَلَكُم مُّسْتَخْلَفِينَ فِيهِ ۖ فَالَّذِينَ آمَنُوا مِنكُمْ وَأَنفَقُوا لَهُمْ أَجْرٌ كَبِيرٌ",
        "verse-english": "Believe in Allah and His Messenger and spend out of that in which He has made you successors. For those who have believed among you and spent, there will be a great reward.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Believe in God and His Messenger and spend out of that in which He has made you successors."
            },
            {
                "clause": "For those who have believed among you and spent,"
            },
            {
                "clause": "there will be a great reward."
            }
        ]
    },
    "5083": {
        "chapter": 57,
        "verse-number": 8,
        "verse-arabic": "وَمَا لَكُمْ لَا تُؤْمِنُونَ بِاللَّهِ ۙ وَالرَّسُولُ يَدْعُوكُمْ لِتُؤْمِنُوا بِرَبِّكُمْ وَقَدْ أَخَذَ مِيثَاقَكُمْ إِن كُنتُم مُّؤْمِنِينَ",
        "verse-english": "And why do you not believe in Allah while the Messenger invites you to believe in your Lord and He has taken your covenant, if you should [truly] be believers?",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And why do you not believe in God while the Messenger invites you to believe in your Lord and He has taken your covenant,"
            },
            {
                "clause": "if you should [truly] be believers?"
            }
        ]
    },
    "5084": {
        "chapter": 57,
        "verse-number": 9,
        "verse-arabic": "هُوَ الَّذِي يُنَزِّلُ عَلَىٰ عَبْدِهِ آيَاتٍ بَيِّنَاتٍ لِّيُخْرِجَكُم مِّنَ الظُّلُمَاتِ إِلَى النُّورِ ۚ وَإِنَّ اللَّهَ بِكُمْ لَرَءُوفٌ رَّحِيمٌ",
        "verse-english": "It is He who sends down upon His Servant [Muhammad] verses of clear evidence that He may bring you out from darknesses into the light. And indeed, Allah is to you Kind and Merciful.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "It is He who sends down upon His Servant [Muhammad] verses of clear evidence that He may bring you out from darknesses into the light."
            },
            {
                "clause": "And indeed,"
            },
            {
                "clause": "God is to you Kind and Merciful."
            }
        ]
    },
    "5085": {
        "chapter": 57,
        "verse-number": 10,
        "verse-arabic": "وَمَا لَكُمْ أَلَّا تُنفِقُوا فِي سَبِيلِ اللَّهِ وَلِلَّهِ مِيرَاثُ السَّمَاوَاتِ وَالْأَرْضِ ۚ لَا يَسْتَوِي مِنكُم مَّنْ أَنفَقَ مِن قَبْلِ الْفَتْحِ وَقَاتَلَ ۚ أُولَٰئِكَ أَعْظَمُ دَرَجَةً مِّنَ الَّذِينَ أَنفَقُوا مِن بَعْدُ وَقَاتَلُوا ۚ وَكُلًّا وَعَدَ اللَّهُ الْحُسْنَىٰ ۚ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ",
        "verse-english": "And why do you not spend in the cause of Allah while to Allah belongs the heritage of the heavens and the earth? Not equal among you are those who spent before the conquest [of Makkah] and fought [and those who did so after it]. Those are greater in degree than they who spent afterwards and fought. But to all Allah has promised the best [reward]. And Allah, with what you do, is Acquainted.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And why do you not spend in the cause of God while to God belongs the heritage of the heavens and the earth?"
            },
            {
                "clause": "Not equal among you are those who spent before the conquest [of Makkah] and fought [and those who did so after it]."
            },
            {
                "clause": "Those are greater in degree than they who spent afterwards and fought."
            },
            {
                "clause": "But to all God has promised the best [reward]."
            },
            {
                "clause": "And God,"
            },
            {
                "clause": "with what you do,"
            },
            {
                "clause": "is Acquainted."
            }
        ]
    },
    "5086": {
        "chapter": 57,
        "verse-number": 11,
        "verse-arabic": "مَّن ذَا الَّذِي يُقْرِضُ اللَّهَ قَرْضًا حَسَنًا فَيُضَاعِفَهُ لَهُ وَلَهُ أَجْرٌ كَرِيمٌ",
        "verse-english": "Who is it that would loan Allah a goodly loan so He will multiply it for him and he will have a noble reward?",
        "clauses-arabic": [
            {
                "clause": "مَّن ذَا الَّذِي يُقْرِضُ اللَّهَ قَرْضًا حَسَنًا فَيُضَاعِفَهُ لَهُ وَلَهُ أَجْرٌ كَرِيمٌ"
            }
        ],
        "clauses-english": [
            {
                "clause": "Who is it that would loan God a goodly loan so He will multiply it for him and he will have a noble reward?"
            }
        ]
    },
    "5087": {
        "chapter": 57,
        "verse-number": 12,
        "verse-arabic": "يَوْمَ تَرَى الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ يَسْعَىٰ نُورُهُم بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِم بُشْرَاكُمُ الْيَوْمَ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا ۚ ذَٰلِكَ هُوَ الْفَوْزُ الْعَظِيمُ",
        "verse-english": "On the Day you see the believing men and believing women, their light proceeding before them and on their right, [it will be said], \"Your good tidings today are [of] gardens beneath which rivers flow, wherein you will abide eternally.\" That is what is the great attainment.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "On the Day you see the believing men and believing women,"
            },
            {
                "clause": "their light proceeding before them and on their right,"
            },
            {
                "clause": "[it will be said],"
            },
            {
                "clause": "\"Your good tidings today are [of] gardens beneath which rivers flow,"
            },
            {
                "clause": "wherein you will abide eternally."
            },
            {
                "clause": "\" That is what is the great attainment."
            }
        ]
    },
    "5088": {
        "chapter": 57,
        "verse-number": 13,
        "verse-arabic": "يَوْمَ يَقُولُ الْمُنَافِقُونَ وَالْمُنَافِقَاتُ لِلَّذِينَ آمَنُوا انظُرُونَا نَقْتَبِسْ مِن نُّورِكُمْ قِيلَ ارْجِعُوا وَرَاءَكُمْ فَالْتَمِسُوا نُورًا فَضُرِبَ بَيْنَهُم بِسُورٍ لَّهُ بَابٌ بَاطِنُهُ فِيهِ الرَّحْمَةُ وَظَاهِرُهُ مِن قِبَلِهِ الْعَذَابُ",
        "verse-english": "On the [same] Day the hypocrite men and hypocrite women will say to those who believed, \"Wait for us that we may acquire some of your light.\" It will be said, \"Go back behind you and seek light.\" And a wall will be placed between them with a door, its interior containing mercy, but on the outside of it is torment.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "On the [same] Day the hypocrite men and hypocrite women will say to those who believed,"
            },
            {
                "clause": "\"Wait for us that we may acquire some of your light."
            },
            {
                "clause": "\" It will be said,"
            },
            {
                "clause": "\"Go back behind you and seek light."
            },
            {
                "clause": "\" And a wall will be placed between them with a door,"
            },
            {
                "clause": "its interior containing mercy,"
            },
            {
                "clause": "but on the outside of it is torment."
            }
        ]
    },
    "5089": {
        "chapter": 57,
        "verse-number": 14,
        "verse-arabic": "يُنَادُونَهُمْ أَلَمْ نَكُن مَّعَكُمْ ۖ قَالُوا بَلَىٰ وَلَٰكِنَّكُمْ فَتَنتُمْ أَنفُسَكُمْ وَتَرَبَّصْتُمْ وَارْتَبْتُمْ وَغَرَّتْكُمُ الْأَمَانِيُّ حَتَّىٰ جَاءَ أَمْرُ اللَّهِ وَغَرَّكُم بِاللَّهِ الْغَرُورُ",
        "verse-english": "The hypocrites will call to the believers, \"Were we not with you?\" They will say, \"Yes, but you afflicted yourselves and awaited [misfortune for us] and doubted, and wishful thinking deluded you until there came the command of Allah. And the Deceiver deceived you concerning Allah.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "The hypocrites will call to the believers,"
            },
            {
                "clause": "\"Were we not with you?"
            },
            {
                "clause": "\" They will say,"
            },
            {
                "clause": "\"Yes,"
            },
            {
                "clause": "but you afflicted yourselves and awaited [misfortune for us] and doubted,"
            },
            {
                "clause": "and wishful thinking deluded you until there came the command of God."
            },
            {
                "clause": "And the Deceiver deceived you concerning God."
            }
        ]
    },
    "5090": {
        "chapter": 57,
        "verse-number": 15,
        "verse-arabic": "فَالْيَوْمَ لَا يُؤْخَذُ مِنكُمْ فِدْيَةٌ وَلَا مِنَ الَّذِينَ كَفَرُوا ۚ مَأْوَاكُمُ النَّارُ ۖ هِيَ مَوْلَاكُمْ ۖ وَبِئْسَ الْمَصِيرُ",
        "verse-english": "So today no ransom will be taken from you or from those who disbelieved. Your refuge is the Fire. It is most worthy of you, and wretched is the destination.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "So today no ransom will be taken from you or from those who disbelieved."
            },
            {
                "clause": "Your refuge is the Fire."
            },
            {
                "clause": "It is most worthy of you,"
            },
            {
                "clause": "and wretched is the destination."
            }
        ]
    },
    "5091": {
        "chapter": 57,
        "verse-number": 16,
        "verse-arabic": "۞ أَلَمْ يَأْنِ لِلَّذِينَ آمَنُوا أَن تَخْشَعَ قُلُوبُهُمْ لِذِكْرِ اللَّهِ وَمَا نَزَلَ مِنَ الْحَقِّ وَلَا يَكُونُوا كَالَّذِينَ أُوتُوا الْكِتَابَ مِن قَبْلُ فَطَالَ عَلَيْهِمُ الْأَمَدُ فَقَسَتْ قُلُوبُهُمْ ۖ وَكَثِيرٌ مِّنْهُمْ فَاسِقُونَ",
        "verse-english": "Has the time not come for those who have believed that their hearts should become humbly submissive at the remembrance of Allah and what has come down of the truth? And let them not be like those who were given the Scripture before, and a long period passed over them, so their hearts hardened; and many of them are defiantly disobedient.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Has the time not come for those who have believed that their hearts should become humbly submissive at the remembrance of God and what has come down of the truth?"
            },
            {
                "clause": "And let them not be like those who were given the Scripture before,"
            },
            {
                "clause": "and a long period passed over them,"
            },
            {
                "clause": "so their hearts hardened;"
            },
            {
                "clause": "and many of them are defiantly disobedient."
            }
        ]
    },
    "5092": {
        "chapter": 57,
        "verse-number": 17,
        "verse-arabic": "اعْلَمُوا أَنَّ اللَّهَ يُحْيِي الْأَرْضَ بَعْدَ مَوْتِهَا ۚ قَدْ بَيَّنَّا لَكُمُ الْآيَاتِ لَعَلَّكُمْ تَعْقِلُونَ",
        "verse-english": "Know that Allah gives life to the earth after its lifelessness. We have made clear to you the signs; perhaps you will understand.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Know that God gives life to the earth after its lifelessness."
            },
            {
                "clause": "We have made clear to you the signs;"
            },
            {
                "clause": "perhaps you will understand."
            }
        ]
    },
    "5093": {
        "chapter": 57,
        "verse-number": 18,
        "verse-arabic": "إِنَّ الْمُصَّدِّقِينَ وَالْمُصَّدِّقَاتِ وَأَقْرَضُوا اللَّهَ قَرْضًا حَسَنًا يُضَاعَفُ لَهُمْ وَلَهُمْ أَجْرٌ كَرِيمٌ",
        "verse-english": "Indeed, the men who practice charity and the women who practice charity and [they who] have loaned Allah a goodly loan - it will be multiplied for them, and they will have a noble reward.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Indeed,"
            },
            {
                "clause": "the men who practice charity and the women who practice charity and [they who] have loaned God a goodly loan -"
            },
            {
                "clause": "it will be multiplied for them,"
            },
            {
                "clause": "and they will have a noble reward."
            }
        ]
    },
    "5094": {
        "chapter": 57,
        "verse-number": 19,
        "verse-arabic": "وَالَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ أُولَٰئِكَ هُمُ الصِّدِّيقُونَ ۖ وَالشُّهَدَاءُ عِندَ رَبِّهِمْ لَهُمْ أَجْرُهُمْ وَنُورُهُمْ ۖ وَالَّذِينَ كَفَرُوا وَكَذَّبُوا بِآيَاتِنَا أُولَٰئِكَ أَصْحَابُ الْجَحِيمِ",
        "verse-english": "And those who have believed in Allah and His messengers - those are [in the ranks of] the supporters of truth and the martyrs, with their Lord. For them is their reward and their light. But those who have disbelieved and denied Our verses - those are the companions of Hellfire.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And those who have believed in God and His messengers -"
            },
            {
                "clause": "those are [in the ranks of] the supporters of truth and the martyrs,"
            },
            {
                "clause": "with their Lord."
            },
            {
                "clause": "For them is their reward and their light."
            },
            {
                "clause": "But those who have disbelieved and denied Our verses -"
            },
            {
                "clause": "those are the companions of Hellfire."
            }
        ]
    },
    "5095": {
        "chapter": 57,
        "verse-number": 20,
        "verse-arabic": "اعْلَمُوا أَنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ وَزِينَةٌ وَتَفَاخُرٌ بَيْنَكُمْ وَتَكَاثُرٌ فِي الْأَمْوَالِ وَالْأَوْلَادِ ۖ كَمَثَلِ غَيْثٍ أَعْجَبَ الْكُفَّارَ نَبَاتُهُ ثُمَّ يَهِيجُ فَتَرَاهُ مُصْفَرًّا ثُمَّ يَكُونُ حُطَامًا ۖ وَفِي الْآخِرَةِ عَذَابٌ شَدِيدٌ وَمَغْفِرَةٌ مِّنَ اللَّهِ وَرِضْوَانٌ ۚ وَمَا الْحَيَاةُ الدُّنْيَا إِلَّا مَتَاعُ الْغُرُورِ",
        "verse-english": "Know that the life of this world is but amusement and diversion and adornment and boasting to one another and competition in increase of wealth and children - like the example of a rain whose [resulting] plant growth pleases the tillers; then it dries and you see it turned yellow; then it becomes [scattered] debris. And in the Hereafter is severe punishment and forgiveness from Allah and approval. And what is the worldly life except the enjoyment of delusion.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Know that the life of this world is but amusement and diversion and adornment and boasting to one another and competition in increase of wealth and children -"
            },
            {
                "clause": "like the example of a rain whose [resulting] plant growth pleases the tillers;"
            },
            {
                "clause": "then it dries and you see it turned yellow;"
            },
            {
                "clause": "then it becomes [scattered] debris."
            },
            {
                "clause": "And in the Hereafter is severe punishment and forgiveness from God and approval."
            },
            {
                "clause": "And what is the worldly life except the enjoyment of delusion."
            }
        ]
    },
    "5096": {
        "chapter": 57,
        "verse-number": 21,
        "verse-arabic": "سَابِقُوا إِلَىٰ مَغْفِرَةٍ مِّن رَّبِّكُمْ وَجَنَّةٍ عَرْضُهَا كَعَرْضِ السَّمَاءِ وَالْأَرْضِ أُعِدَّتْ لِلَّذِينَ آمَنُوا بِاللَّهِ وَرُسُلِهِ ۚ ذَٰلِكَ فَضْلُ اللَّهِ يُؤْتِيهِ مَن يَشَاءُ ۚ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ",
        "verse-english": "Race toward forgiveness from your Lord and a Garden whose width is like the width of the heavens and earth, prepared for those who believed in Allah and His messengers. That is the bounty of Allah which He gives to whom He wills, and Allah is the possessor of great bounty.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Race toward forgiveness from your Lord and a Garden whose width is like the width of the heavens and earth,"
            },
            {
                "clause": "prepared for those who believed in God and His messengers."
            },
            {
                "clause": "That is the bounty of God which He gives to whom He wills,"
            },
            {
                "clause": "and God is the possessor of great bounty."
            }
        ]
    },
    "5097": {
        "chapter": 57,
        "verse-number": 22,
        "verse-arabic": "مَا أَصَابَ مِن مُّصِيبَةٍ فِي الْأَرْضِ وَلَا فِي أَنفُسِكُمْ إِلَّا فِي كِتَابٍ مِّن قَبْلِ أَن نَّبْرَأَهَا ۚ إِنَّ ذَٰلِكَ عَلَى اللَّهِ يَسِيرٌ",
        "verse-english": "No disaster strikes upon the earth or among yourselves except that it is in a register before We bring it into being - indeed that, for Allah, is easy -",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "No disaster strikes upon the earth or among yourselves except that it is in a register before We bring it into being -"
            },
            {
                "clause": "indeed that,"
            },
            {
                "clause": "for God,"
            },
            {
                "clause": "is easy -"
            }
        ]
    },
    "5098": {
        "chapter": 57,
        "verse-number": 23,
        "verse-arabic": "لِّكَيْلَا تَأْسَوْا عَلَىٰ مَا فَاتَكُمْ وَلَا تَفْرَحُوا بِمَا آتَاكُمْ ۗ وَاللَّهُ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ",
        "verse-english": "In order that you not despair over what has eluded you and not exult [in pride] over what He has given you. And Allah does not like everyone self-deluded and boastful -",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "In order that you not despair over what has eluded you and not exult [in pride] over what He has given you."
            },
            {
                "clause": "And God does not like everyone self-"
            },
            {
                "clause": "deluded and boastful -"
            }
        ]
    },
    "5099": {
        "chapter": 57,
        "verse-number": 24,
        "verse-arabic": "الَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ النَّاسَ بِالْبُخْلِ ۗ وَمَن يَتَوَلَّ فَإِنَّ اللَّهَ هُوَ الْغَنِيُّ الْحَمِيدُ",
        "verse-english": "[Those] who are stingy and enjoin upon people stinginess. And whoever turns away - then indeed, Allah is the Free of need, the Praiseworthy.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "[Those] who are stingy and enjoin upon people stinginess."
            },
            {
                "clause": "And whoever turns away -"
            },
            {
                "clause": "then indeed,"
            },
            {
                "clause": "God is the Free of need,"
            },
            {
                "clause": "the Praiseworthy."
            }
        ]
    },
    "5100": {
        "chapter": 57,
        "verse-number": 25,
        "verse-arabic": "لَقَدْ أَرْسَلْنَا رُسُلَنَا بِالْبَيِّنَاتِ وَأَنزَلْنَا مَعَهُمُ الْكِتَابَ وَالْمِيزَانَ لِيَقُومَ النَّاسُ بِالْقِسْطِ ۖ وَأَنزَلْنَا الْحَدِيدَ فِيهِ بَأْسٌ شَدِيدٌ وَمَنَافِعُ لِلنَّاسِ وَلِيَعْلَمَ اللَّهُ مَن يَنصُرُهُ وَرُسُلَهُ بِالْغَيْبِ ۚ إِنَّ اللَّهَ قَوِيٌّ عَزِيزٌ",
        "verse-english": "We have already sent Our messengers with clear evidences and sent down with them the Scripture and the balance that the people may maintain [their affairs] in justice. And We sent down iron, wherein is great military might and benefits for the people, and so that Allah may make evident those who support Him and His messengers unseen. Indeed, Allah is Powerful and Exalted in Might.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "We have already sent Our messengers with clear evidences and sent down with them the Scripture and the balance that the people may maintain [their affairs] in justice."
            },
            {
                "clause": "And We sent down iron,"
            },
            {
                "clause": "wherein is great military might and benefits for the people,"
            },
            {
                "clause": "and so that God may make evident those who support Him and His messengers unseen."
            },
            {
                "clause": "Indeed,"
            },
            {
                "clause": "God is Powerful and Exalted in Might."
            }
        ]
    },
    "5101": {
        "chapter": 57,
        "verse-number": 26,
        "verse-arabic": "وَلَقَدْ أَرْسَلْنَا نُوحًا وَإِبْرَاهِيمَ وَجَعَلْنَا فِي ذُرِّيَّتِهِمَا النُّبُوَّةَ وَالْكِتَابَ ۖ فَمِنْهُم مُّهْتَدٍ ۖ وَكَثِيرٌ مِّنْهُمْ فَاسِقُونَ",
        "verse-english": "And We have already sent Noah and Abraham and placed in their descendants prophethood and scripture; and among them is he who is guided, but many of them are defiantly disobedient.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "And We have already sent Noah and Abraham and placed in their descendants prophethood and scripture;"
            },
            {
                "clause": "and among them is he who is guided,"
            },
            {
                "clause": "but many of them are defiantly disobedient."
            }
        ]
    },
    "5102": {
        "chapter": 57,
        "verse-number": 27,
        "verse-arabic": "ثُمَّ قَفَّيْنَا عَلَىٰ آثَارِهِم بِرُسُلِنَا وَقَفَّيْنَا بِعِيسَى ابْنِ مَرْيَمَ وَآتَيْنَاهُ الْإِنجِيلَ وَجَعَلْنَا فِي قُلُوبِ الَّذِينَ اتَّبَعُوهُ رَأْفَةً وَرَحْمَةً وَرَهْبَانِيَّةً ابْتَدَعُوهَا مَا كَتَبْنَاهَا عَلَيْهِمْ إِلَّا ابْتِغَاءَ رِضْوَانِ اللَّهِ فَمَا رَعَوْهَا حَقَّ رِعَايَتِهَا ۖ فَآتَيْنَا الَّذِينَ آمَنُوا مِنْهُمْ أَجْرَهُمْ ۖ وَكَثِيرٌ مِّنْهُمْ فَاسِقُونَ",
        "verse-english": "Then We sent following their footsteps Our messengers and followed [them] with Jesus, the son of Mary, and gave him the Gospel. And We placed in the hearts of those who followed him compassion and mercy and monasticism, which they innovated; We did not prescribe it for them except [that they did so] seeking the approval of Allah. But they did not observe it with due observance. So We gave the ones who believed among them their reward, but many of them are defiantly disobedient.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "Then We sent following their footsteps Our messengers and followed [them] with Jesus,"
            },
            {
                "clause": "the son of Mary,"
            },
            {
                "clause": "and gave him the Gospel."
            },
            {
                "clause": "And We placed in the hearts of those who followed him compassion and mercy and monasticism,"
            },
            {
                "clause": "which they innovated;"
            },
            {
                "clause": "We did not prescribe it for them except [that they did so] seeking the approval of God."
            },
            {
                "clause": "But they did not observe it with due observance."
            },
            {
                "clause": "So We gave the ones who believed among them their reward,"
            },
            {
                "clause": "but many of them are defiantly disobedient."
            }
        ]
    },
    "5103": {
        "chapter": 57,
        "verse-number": 28,
        "verse-arabic": "يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَآمِنُوا بِرَسُولِهِ يُؤْتِكُمْ كِفْلَيْنِ مِن رَّحْمَتِهِ وَيَجْعَل لَّكُمْ نُورًا تَمْشُونَ بِهِ وَيَغْفِرْ لَكُمْ ۚ وَاللَّهُ غَفُورٌ رَّحِيمٌ",
        "verse-english": "O you who have believed, fear Allah and believe in His Messenger; He will [then] give you a double portion of His mercy and make for you a light by which you will walk and forgive you; and Allah is Forgiving and Merciful.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "O you who have believed,"
            },
            {
                "clause": "fear God and believe in His Messenger;"
            },
            {
                "clause": "He will [then] give you a double portion of His mercy and make for you a light by which you will walk and forgive you;"
            },
            {
                "clause": "and God is Forgiving and Merciful."
            }
        ]
    },
    "5104": {
        "chapter": 57,
        "verse-number": 29,
        "verse-arabic": "لِّئَلَّا يَعْلَمَ أَهْلُ الْكِتَابِ أَلَّا يَقْدِرُونَ عَلَىٰ شَيْءٍ مِّن فَضْلِ اللَّهِ ۙ وَأَنَّ الْفَضْلَ بِيَدِ اللَّهِ يُؤْتِيهِ مَن يَشَاءُ ۚ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ",
        "verse-english": "[This is] so that the People of the Scripture may know that they are not able [to obtain] anything from the bounty of Allah and that [all] bounty is in the hand of Allah; He gives it to whom He wills. And Allah is the possessor of great bounty.",
        "clauses-arabic": [
            {
                "clause": ""
            },
            {
                "clause": ""
            },
            {
                "clause": ""
            }
        ],
        "clauses-english": [
            {
                "clause": "[This is] so that the People of the Scripture may know that they are not able [to obtain] anything from the bounty of God and that [all] bounty is in the hand of God;"
            },
            {
                "clause": "He gives it to whom He wills."
            },
            {
                "clause": "And God is the possessor of great bounty."
            }
        ]
    }
}